---
title: windows开发
tags: 开发
categories: 技术
mathjax: true

---

暂未完成

<!-- more -->

# Win32课程有哪些内容

1. 字符
2. 多线程
3. 线程同步
4. 窗口的本质
5. windows消息机制
6. 子窗口的使用
7. 进程
8. 内存管理
9. 文件系统
10. 内存映射
11. DLL
12. 远程注入
13. 模块隐藏
14. 进程通信
15. HOOK专题（各种类型HOOK/绕过全代码校验）

malloc在windows上的底层也是win32实现的

# 字符编码

## ANSI编码

### **原始**的ASCII编码

![4f06232eed4f93be762cd15d664b407c](https://raw.githubusercontent.com/che77a38/blogImage/main/4f06232eed4f93be762cd15d664b407c.jpeg)

![05d27497327d7264b74d178aaf312830](https://raw.githubusercontent.com/che77a38/blogImage/main/05d27497327d7264b74d178aaf312830.jpeg)

原始的ASCII码只占一个字节

### ASCII编码的拓展：GB2312（GBK）或GB2312-80

GB2312或GB2312-80：专门用来表示中文的编码

#### 实现原理：

把80~FF的表给占用了，由80~FF开头的两个字节拼在一起表示一个字符

```
中国
D6 D0 B9 FA
```

GB2312（GBK）或GB2312-80也就是ANSI编码（各国各自的编码格式统称ANSI）

#### 缺点

其他象形文字国家也是采取和我国一样的策略，所以各个国家看到的同一个编码意思不一致。

ANSI编码也就是GB2312（GBK）或GB2312-80，表示英文字符时用一个字节，表示中文字符时用两个或4个字节

## UNICODE编码

一张包含全世界所有文字的一个编码表，Unicode的编码范围是：0~0x10FFFF，可以容纳100多万个符号！

但他只是一个符号集，只规定了符号的二进制代码，却没有规定这个二进制代码应该如何存储。

### **UNICODE编码的存储方式**

#### UTF-16

UTF-16编码以16位无符号整数为单位，注意是16位为一个单位，不表示一个字符就只有16位。这个要看字符的unicode编码处于什么范围而定的，有**可能是2个字节，也可能是4个字节**。**现在机器上的unicode编码一般指的就是UTF-16。**

```
UTF-16小端存储
中国A
2D 4E FD 56 41 00

UTF-16大端存储
中国A
4E 2D 56 FD 00 41
```

![image-20210613135932861](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210613135932861.png)


	if (!dwDllStrAddress)
	{
		outDebugString("WinTool VirtualAllocEx ERROR\n");
		CloseHandle(hProcess);
		return FALSE;
	}
	//将DLL路径名称拷贝到目标进程内存中

	BOOL bRet = WriteProcessMemory(hProcess, dwDllStrAddress, szDllName, dwStrLength, NULL);
	if (!bRet)
	{
		outDebugString("WinTool WriteProcessMemory ERROR\n");
		VirtualFreeEx(hProcess, dwDllStrAddress, 0, MEM_RELEASE);
		CloseHandle(hProcess);
		return FALSE;
	}
	//获取模块句柄
	HMODULE hModule = GetModuleHandle(TEXT("kernel32.dll"));//同一操作系统下，kernel32.dll位置一样。
	if (!hModule)
	{
		outDebugString("WinTool GetModuleHandle ERROR\n");
		VirtualFreeEx(hProcess, dwDllStrAddress, 0, MEM_RELEASE);
		CloseHandle(hProcess);
		return FALSE;
	}

	//获取LoadLibrary函数地址
#ifdef UNICODE
	DWORD dwLoadLibraryAddress = (DWORD)GetProcAddress(hModule, "LoadLibraryW");
#else
	DWORD dwLoadLibraryAddress = (DWORD)GetProcAddress(hModule, "LoadLibraryA");
#endif // UNICODE
	if (!dwLoadLibraryAddress)
	{
		outDebugString("WinTool GetProcAddress ERROR\n");
		VirtualFreeEx(hProcess, dwDllStrAddress, 0, MEM_RELEASE);
		CloseHandle(hProcess);
		CloseHandle(hModule);
		return FALSE;
	}

	HANDLE hThread = CreateRemoteThread(hProcess, NULL, 0, (LPTHREAD_START_ROUTINE)dwLoadLibraryAddress, dwDllStrAddress, 0, NULL);
	if (!hThread|| hThread == INVALID_HANDLE_VALUE)
	{
		outDebugString("WinTool CreateRemoteThread ERROR\n");
		VirtualFreeEx(hProcess, dwDllStrAddress, 0, MEM_RELEASE);
		CloseHandle(hProcess);
		CloseHandle(hModule);
		return FALSE;
	}
	VirtualFreeEx(hProcess, dwDllStrAddress, 0, MEM_RELEASE);
	CloseHandle(hThread);
	CloseHandle(hProcess);
	CloseHandle(hModule);
	
	return TRUE;
}
```

# 进程间通信

进程间通信有很多种手段

1. 管道
2. 消息队列
3. 信号量
4. 共享内存
5. 等等

看似很多，但本质上都是**共享内存**

`注入游戏的DLL带窗口是没有实用价值的，因为特征太明显了。`

# 三环遍历进程代码

```c
//遍历全部进程名
	PROCESSENTRY32 pe32;
	pe32.dwSize = sizeof(pe32);
	HANDLE hSnapshot_proc = CreateToolhelp32Snapshot(TH32CS_SNAPPROCESS, 0);
	if (hSnapshot_proc != INVALID_HANDLE_VALUE)
	{
		BOOL check = Process32First(hSnapshot_proc, &pe32);
		while (check)
		{
			myOutPutDebug("进程PID = %d 进程名 = %s\n", pe32.th32ProcessID, pe32.szExeFile);
			check = Process32Next(hSnapshot_proc, &pe32);
		}
	}
	CloseHandle(hSnapshot_proc);
```

# 模块隐藏

直接注入的DLL是很容易被目标程序检测到的。

所以需要模块隐藏

TEB和PEB都是三环结构体。

## 模块隐藏之断链

windows的三环API查的就是这些数据块，TEB和PEB

就是注入后，模块已经在进程内存空间中了，在PEB中的Ldr指向的模块双向链表中把注入的模块给断链。用户层API就无法找到你的模块了

### TEB

《1》TEB（Thread Environment Block），它记录的相关线程的信息，每个线程都有自己的TEB，FS:[0]即是**当前线程**的TEB。
$$
mov\ \ eax,fs:[0]
$$


```cpp
typedef struct _TEB {
  PVOID Reserved1[12];
  PPEB  ProcessEnvironmentBlock;//指向PEB
  PVOID Reserved2[399];
  BYTE  Reserved3[1952];
  PVOID TlsSlots[64];
  BYTE  Reserved4[8];
  PVOID Reserved5[26];
  PVOID ReservedForOle;
  PVOID Reserved6[4];
  PVOID TlsExpansionSlots;
} TEB, *PTEB;
//====================偏移详解===================
kd> dt _teb
nt!_TEB
   +0x000 NtTib            : _NT_TIB		//重要成员，内嵌_NT_TIB结构体
   +0x01c EnvironmentPointer : Ptr32 Void
   +0x020 ClientId         : _CLIENT_ID    //内嵌_CLIENT_ID结构，内含进程id和线程id
   +0x028 ActiveRpcHandle  : Ptr32 Void
   +0x02c ThreadLocalStoragePointer : Ptr32 Void
   +0x030 ProcessEnvironmentBlock : Ptr32 _PEB             //重要成员，进程PEB
   +0x034 LastErrorValue   : Uint4B		//上个错误号
   +0x038 CountOfOwnedCriticalSections : Uint4B
   +0x03c CsrClientThread  : Ptr32 Void
   +0x040 Win32ThreadInfo  : Ptr32 Void
   +0x044 User32Reserved   : [26] Uint4B
   +0x0ac UserReserved     : [5] Uint4B
   +0x0c0 WOW32Reserved    : Ptr32 Void
   +0x0c4 CurrentLocale    : Uint4B
   +0x0c8 FpSoftwareStatusRegister : Uint4B
   +0x0cc SystemReserved1  : [54] Ptr32 Void
   +0x1a4 ExceptionCode    : Int4B
   +0x1a8 ActivationContextStack : _ACTIVATION_CONTEXT_STACK
   +0x1bc SpareBytes1      : [24] UChar
   +0x1d4 GdiTebBatch      : _GDI_TEB_BATCH
   +0x6b4 RealClientId     : _CLIENT_ID
   +0x6bc GdiCachedProcessHandle : Ptr32 Void
   +0x6c0 GdiClientPID     : Uint4B
   +0x6c4 GdiClientTID     : Uint4B
   +0x6c8 GdiThreadLocalInfo : Ptr32 Void
   +0x6cc Win32ClientInfo  : [62] Uint4B
   +0x7c4 glDispatchTable  : [233] Ptr32 Void
   +0xb68 glReserved1      : [29] Uint4B
   +0xbdc glReserved2      : Ptr32 Void
   +0xbe0 glSectionInfo    : Ptr32 Void
   +0xbe4 glSection        : Ptr32 Void
   +0xbe8 glTable          : Ptr32 Void
   +0xbec glCurrentRC      : Ptr32 Void
   +0xbf0 glContext        : Ptr32 Void
   +0xbf4 LastStatusValue  : Uint4B
   +0xbf8 StaticUnicodeString : _UNICODE_STRING
   +0xc00 StaticUnicodeBuffer : [261] Uint2B
   +0xe0c DeallocationStack : Ptr32 Void
   +0xe10 TlsSlots         : [64] Ptr32 Void                  //TLS值 是个数组[64]
   +0xf10 TlsLinks         : _LIST_ENTRY
   +0xf18 Vdm              : Ptr32 Void
   +0xf1c ReservedForNtRpc : Ptr32 Void
   +0xf20 DbgSsReserved    : [2] Ptr32 Void
   +0xf28 HardErrorsAreDisabled : Uint4B
   +0xf2c Instrumentation  : [16] Ptr32 Void
   +0xf6c WinSockData      : Ptr32 Void
   +0xf70 GdiBatchCount    : Uint4B
   +0xf74 InDbgPrint       : UChar
   +0xf75 FreeStackOnTermination : UChar
   +0xf76 HasFiberData     : UChar
   +0xf77 IdealProcessor   : UChar
   +0xf78 Spare3           : Uint4B
   +0xf7c ReservedForPerf  : Ptr32 Void
   +0xf80 ReservedForOle   : Ptr32 Void
   +0xf84 WaitingOnLoaderLock : Uint4B
   +0xf88 Wx86Thread       : _Wx86ThreadState
   +0xf94 TlsExpansionSlots : Ptr32 Ptr32 Void                //TLS扩展值 是个数组[Ptr32]
   +0xf98 ImpersonationLocale : Uint4B
   +0xf9c IsImpersonating  : Uint4B
   +0xfa0 NlsCache         : Ptr32 Void
   +0xfa4 pShimData        : Ptr32 Void
   +0xfa8 HeapVirtualAffinity : Uint4B
   +0xfac CurrentTransactionHandle : Ptr32 Void
   +0xfb0 ActiveFrame      : Ptr32 _TEB_ACTIVE_FRAME
   +0xfb4 SafeThunkCall    : UChar
   +0xfb5 BooleanSpare     : [3] UChar
```

```cpp
//重要结构使用说明
FS:[000]   指向SEH链指针
FS:[004]  线程堆栈顶部
FS:[008] 线程堆栈底部
FS:[00C]  SubSystemTib
FS:[010]  FiberData
FS:[014] ArbitraryUserPointer
FS:[018]  指向TEB自身
FS:[020] 进程PID
FS:[024] 线程ID
FS:[02C] 指向线程局部存储指针
FS:[030] PEB结构地址（进程结构）
FS:[034] 上个错误号
```

[TEB详解]: https://docs.microsoft.com/zh-cn/windows/win32/api/winternl/ns-winternl-teb

![image-20210706131700275](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210706131700275.png)

#### NtTib成员

```cpp
//NtTib成员
typedef struct	_NT_TIB{
	 struct	_EXCEPTION_REGISTRATION_RECORD *ExceptionList;//指向_EXCEPTION_REGISTRATION_RECORD结构体组成的链表，它用于WindowsOS的SEH， SEH是Wiondows操作系统中的结构化异常处理机制，常用于反调试技术。
	 PVOID StackBase;
	 PVOID StackLimit; 
	 PVOID SubSystemTib; 
	 union {
		PVOID FiberData; 
		DWORD Version;
	 }; 
	 PVOID ArbitraryUserPointer;
 	 struct	_NT_TIB *Self;//Self成员是_NT_TIB结构体的自引用指针，它指向_NT_TIB结构体，又因为_NT_TIB是TEB结构体的第一个成员，所以它也是指向TEB结构体的指针（它里面存着TEB结构体的地址）。
} NT_TIB;
typedef NT_TIB *PNT_TIB;
//===============偏移详解=============
ntdll!_NT_TIB
   +0x000 ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD　　//当前线程内核异常链表(SEH)
   +0x004 StackBase        : Ptr32 Void　　　　　　　　　　　　　　　　　 //当前线程内核的基址（当前线程栈底）
   +0x008 StackLimit       : Ptr32 Void　　　　　　　　　　　　　　　　　 //当前线程内核的大小（当前线程最高允许的栈顶）
   +0x00c SubSystemTib     : Ptr32 Void
   +0x010 FiberData        : Ptr32 Void
   +0x010 Version          : Uint4B
   +0x014 ArbitraryUserPointer : Ptr32 Void
   +0x018 Self             : Ptr32 _NT_TIB　　　　　　　　　　　　　　　 //指向自己头部，目的为了方便查找
```

_CLIENT_ID成员

```cpp
kd> dt _CLIENT_ID
nt! CLIENT_ID
    +0x000 UniqueProcess  : Ptr32 Void//当前线程所属的进程ID
    +0x004 UniqueThread   : Ptr32 Void//当前线程ID
```

> 32位系统FS三环时指向TEB，零环时用KPCR，而**64位系统三环时用GS指向TEB**，零环时GS指向KPCR（之前32位windows下根本没用过GS），也就是说，在64位下不再用FS指向KPCR和TEB，64位下用GS取代了FS，FS则继续留给32位程序继续用

### PEB

《2》PEB（Process Environment Block，进程环境块）存放进程信息，每个进程都有自己的PEB信息，TEB偏移0x30的位置就是当前进程的PEB
$$
mov\ \ eax,fs:[0x30]
$$
不同的windows版本中TEB结构会不同

```cpp
typedef struct _PEB {               // Size: 0x1D8
    000h    UCHAR           InheritedAddressSpace;
    001h    UCHAR           ReadImageFileExecOptions;
    //下面参数标识当前进程是否处于调试状态，Kernel32.dll中的IsDebuggerPresent() API就是用来获取该处的值的（是，则返回1；否，则返回0）。【破解之法】只要借助OllyDbg调试器的编辑功能，将PEB.BeingDebugged的值修改为0（FALSE）即可。
    002h    UCHAR           BeingDebugged;      //Debug运行标志(可用于反调试技术)，只要该进程被调试就会被置1
    003h    UCHAR           SpareBool;
    004h    HANDLE          Mutant;
    008h    HINSTANCE       ImageBaseAddress;  //程序加载的基地址
    00Ch    struct _PEB_LDR_DATA    *Ldr    //Ptr32 指向_PEB_LDR_DATA结构体，记录了程序包含哪些模块(可用于反调试技术)
    010h    struct _RTL_USER_PROCESS_PARAMETERS  *ProcessParameters;
    014h    ULONG           SubSystemData;
    018h    HANDLE          DefaultHeap;    //(可用于反调试技术)
    01Ch    KSPIN_LOCK      FastPebLock;
    020h    ULONG           FastPebLockRoutine;
    024h    ULONG           FastPebUnlockRoutine;
    028h    ULONG           EnvironmentUpdateCount;
    02Ch    ULONG           KernelCallbackTable;
    030h    LARGE_INTEGER   SystemReserved;
    038h    struct _PEB_FREE_BLOCK  *FreeList
    03Ch    ULONG           TlsExpansionCounter;
    040h    ULONG           TlsBitmap;
    044h    LARGE_INTEGER   TlsBitmapBits;
    04Ch    ULONG           ReadOnlySharedMemoryBase;
    050h    ULONG           ReadOnlySharedMemoryHeap;
    054h    ULONG           ReadOnlyStaticServerData;
    058h    ULONG           AnsiCodePageData;
    05Ch    ULONG           OemCodePageData;
    060h    ULONG           UnicodeCaseTableData;
    064h    ULONG           NumberOfProcessors;
    068h    LARGE_INTEGER   NtGlobalFlag;               // Address of a local copy(可用于反调试技术)
    070h    LARGE_INTEGER   CriticalSectionTimeout;
    078h    ULONG           HeapSegmentReserve;
    07Ch    ULONG           HeapSegmentCommit;
    080h    ULONG           HeapDeCommitTotalFreeThreshold;
    084h    ULONG           HeapDeCommitFreeBlockThreshold;
    088h    ULONG           NumberOfHeaps;
    08Ch    ULONG           MaximumNumberOfHeaps;
    090h    ULONG           ProcessHeaps;
    094h    ULONG           GdiSharedHandleTable;
    098h    ULONG           ProcessStarterHelper;
    09Ch    ULONG           GdiDCAttributeList;
    0A0h    KSPIN_LOCK      LoaderLock;
    0A4h    ULONG           OSMajorVersion;
    0A8h    ULONG           OSMinorVersion;
    0ACh    USHORT          OSBuildNumber;
    0AEh    USHORT          OSCSDVersion;
    0B0h    ULONG           OSPlatformId;
    0B4h    ULONG           ImageSubsystem;
    0B8h    ULONG           ImageSubsystemMajorVersion;
    0BCh    ULONG           ImageSubsystemMinorVersion;
    0C0h    ULONG           ImageProcessAffinityMask;
    0C4h    ULONG           GdiHandleBuffer[0x22];
    14Ch    ULONG           PostProcessInitRoutine;
    150h    ULONG           TlsExpansionBitmap;
    154h    UCHAR           TlsExpansionBitmapBits[0x80];
    1D4h    ULONG           SessionId;
} PEB, *PPEB;
```

#### _PEB_LDR_DATA

PEB loader data 进程环境块装载机信息

```cpp
typedef struct _PEB_LDR_DATA
{
　ULONG         Length;                             // 00h
　BOOLEAN       Initialized;                        // 04h
　PVOID         SsHandle;                           // 08h
　LIST_ENTRY    InLoadOrderModuleList;              // 0ch，加载的时候按顺序有哪些模块的双向链表
　LIST_ENTRY    InMemoryOrderModuleList;            // 14h,加载完了后在内存中有哪些模块的双向链表
　LIST_ENTRY    InInitializationOrderModuleList;    // 1ch，按模块初始化顺序存的双向链表
}PEB_LDR_DATA,*PPEB_LDR_DATA;                       // 24h
```

##### LIST_ENTRY

```cpp
nt!_LIST_ENTRY
   +0x000   Flink       : Ptr32 _LIST_ENTRY     //表示从前往后
   +0x004   Blink       : Ptr32 _LIST_ENTRY     //表示从后往前
//该结构本身就提供了（不需要自己写）
typedef struct _LIST_ENTRY {
   struct _LIST_ENTRY *Flink;
   struct _LIST_ENTRY *Blink;
} LIST_ENTRY, *PLIST_ENTRY, *RESTRICTED_POINTER PRLIST_ENTRY;
```

链表中保存的是_LDR_DATA_TABLE_ENTRY结构体的信息，给结构体如下。

##### _LDR_DATA_TABLE_ENTRY

该结构未导出,需要自己定义

```cpp
//x86
typedef struct _LDR_DATA_TABLE_ENTRY
{
LIST_ENTRY InLoadOrderLinks;//代表按加载顺序构成的模块双向链表
LIST_ENTRY InMemoryOrderLinks;//代表按内存顺序构成的模块双向链表
LIST_ENTRY InInitializationOrderLinks;//代表按初始化顺序构成的模块双向链表
PVOID      DllBase;//该模块的基地址
PVOID      EntryPoint;//该模块的入口
ULONG32    SizeOfImage;//该模块的映像大小
UNICODE_STRING FullDllName;//内嵌包含路径的模块名的结构体
UNICODE_STRING BaseDllName;//内嵌不包含路径的模块名的结构体
UINT32   Unknow[17];

}LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;


//x64
typedef struct _LDR_DATA_TABLE_ENTRY
{
LIST_ENTRY InLoadOrderLinks;
LIST_ENTRY InMemoryOrderLinks;
LIST_ENTRY InInitializationOrderLinks;
PVOID      DllBase;
PVOID      EntryPoint;
ULONG32    SizeOfImage;
UINT8      Unknow0[0x4];
UNICODE_STRING FullDllName;
UNICODE_STRING BaseDllName;
}LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;


@Windows XP Professional Service Pack 3 (x86) (5.1, Build 2600)

lkd> dt -b _LDR_DATA_TABLE_ENTRY
nt!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY//代表按加载顺序构成的模块双向链表
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x008 InMemoryOrderLinks : _LIST_ENTRY//代表按内存顺序构成的模块双向链表
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x010 InInitializationOrderLinks : _LIST_ENTRY//代表按初始化顺序构成的模块双向链表
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x018 DllBase          : Ptr32 //该模块的基地址
   +0x01c EntryPoint       : Ptr32  //该模块的入口
   +0x020 SizeOfImage      : Uint4B	//该模块的映像大小
   +0x024 FullDllName      : _UNICODE_STRING //内嵌包含路径的模块名的结构体
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x004 Buffer           : Ptr32 
   +0x02c BaseDllName      : _UNICODE_STRING //内嵌不包含路径的模块名的结构体
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x004 Buffer           : Ptr32 
   +0x034 Flags            : Uint4B
   +0x038 LoadCount        : Uint2B	//该模块的引用次数
   +0x03a TlsIndex         : Uint2B
   +0x03c HashLinks        : _LIST_ENTRY
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x03c SectionPointer   : Ptr32 
   +0x040 CheckSum         : Uint4B
   +0x044 TimeDateStamp    : Uint4B
   +0x044 LoadedImports    : Ptr32 
   +0x048 EntryPointActivationContext : Ptr32 
   +0x04c PatchInformation : Ptr32

 

@Windows 7 Ultimate (x64) (6.1, Build 7600)

lkd> dt -b _LDR_DATA_TABLE_ENTRY
nt!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x010 InMemoryOrderLinks : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x020 InInitializationOrderLinks : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x030 DllBase          : Ptr64 
   +0x038 EntryPoint       : Ptr64 
   +0x040 SizeOfImage      : Uint4B
   +0x048 FullDllName      : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x058 BaseDllName      : _UNICODE_STRING
      +0x000 Length           : Uint2B
      +0x002 MaximumLength    : Uint2B
      +0x008 Buffer           : Ptr64 
   +0x068 Flags            : Uint4B
   +0x06c LoadCount        : Uint2B
   +0x06e TlsIndex         : Uint2B
   +0x070 HashLinks        : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x070 SectionPointer   : Ptr64 
   +0x078 CheckSum         : Uint4B
   +0x080 TimeDateStamp    : Uint4B
   +0x080 LoadedImports    : Ptr64 
   +0x088 EntryPointActivationContext : Ptr64 
   +0x090 PatchInformation : Ptr64 
   +0x098 ForwarderLinks   : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x0a8 ServiceTagLinks  : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x0b8 StaticLinks      : _LIST_ENTRY
      +0x000 Flink            : Ptr64 
      +0x008 Blink            : Ptr64 
   +0x0c8 ContextInformation : Ptr64 
   +0x0d0 OriginalBase     : Uint8B
   +0x0d8 LoadTime         : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
```

每个加载到进程中的DLL模块都对应一个\_LDR_DATA_TABLE_ENTRY结构体，这些结构体相互链接，最终形成了_LIST_ENTRY双向链表。\_PEB_LDR_DATA结构体中存在3种\_LIST_ENTRY双向链表，也就是说，存在多个\_LDR_DATA_TABLE_ENTRY结构体，并且有三种链接方法可以将它们链接起来。

结构示意图：

![image-20210707145837215](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210707145837215.png)

![image-20210707150201266](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210707150201266.png)

![image-20210707150256851](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210707150256851.png)

![image-20210707153018376](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210707153018376.png)

![image-20210707153029369](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210707153029369.png)

[结构详解]: https://www.freesion.com/article/19771019476/

上面的图实际上都不是那么准确，下面这张图才是真正的结构。

