---
title: 保护模式
tags: 内核相关
categories: 技术


---

Q：什么是保护模式？

<!-- more -->

A：x86 CPU的3个模式：

1. 实模式
2. 保护模式（虚拟8086模式）
3. 系统管理模式

![image-20210803161045133](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210803161045133.png)

现在的操作系统大多数都是运行于保护模式下的

保护模式就是指给操作系统添加的保护特性，保护的目标是硬件资源和OS内核。

# **学习前的环境配置**

由于本人使用的操作系统是win10 1909，因此开发当前版本的驱动需要`vs2019+Windows 10 WDK 2004(10.0.19041.1) + Windows 10 SDK 2004(10.0.19041.1)`

要注意在单个组件中选上：

![image-20210721202744811](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210721202744811.png)

环境配置的[参考网址](https://blog.csdn.net/psbeond/article/details/108780644)

【小注意点】微软官网下载vs2019时有bug，必须等他一段时间弹出下载，不要再点重新下载，不然重新下载的是vs2017，而不是vs2019

下载完毕后，再到微软官网下载Windows 10 WDK 2004(10.0.19041.1)。

至此`vs2019+Windows 10 WDK 2004(10.0.19041.1) + Windows 10 SDK 2004(10.0.19041.1)`环境就装好了。

[虚拟机和符号表对应下载](https://bbs.pediy.com/thread-257955.htm)

## **双机调试配置**

由于系统调试要下断点，下断点后系统将只有调试子系统继续运行，因此不能直接调试本机的系统。因此需要**双机调试配置**

![image-20210722134228056](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210722134228056.png)

配置双机调试流程

1. 在本机安装windbg(上述配环境的时候装WDK，里面自带有windbg)

2. 在虚拟机中(WinXP)修改boot.ini（修改系统启动项）

   C盘显示隐藏文件，找到boot.ini打开

   ![image-20210722135330345](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210722135330345.png)

   原内容：

   ![image-20210722140422465](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210722140422465.png)

   新内容


- RETF 执行远返回：在弹出 IP/EIP(返回地址)后，它会弹出 CS，然后通过可选参数（如果存在）递增堆栈指针，如果返回到另一个特权级别，IRET指令还会在恢复程序执行之前从堆栈中弹出SP(或ESP)和SS，最后将参数计数（以从 RETF  指令获得的字节数）添加到当前 ESP/SP 寄存器值。
- IRETW 将 IP、CS 和flags弹出为 每个2 个字节，总共从堆栈中取出 6 个字节，如果返回到另一个特权级别，IRET指令还会在恢复程序执行之前从堆栈中弹出SP和SS。
- IRETD 将 EIP 弹出为 4 个字节(返回地址)。再弹出 4 个字节，其中前两个被丢弃，后两个进入 CS，并将eflags也弹出为 4 个字节，从堆栈中取出 12 个字节，如果返回到另一个特权级别，IRET指令还会在恢复程序执行之前从堆栈中弹出ESP和SS。
- **IRET 是 IRETW 或 IRETD 的简写，具体取决于当时的默认 BITS 设置。**

##### **【实验】**在调用门中实现使用IRETD返回，在中断门中实现用RETF返回

###### 中断门用RETF返回

```assembly
#include"stdafx.h"
#include "stdio.h"
#include <windows.h>

void __declspec(naked) test()
{
	_asm
    {
        RETF 0x4//中断门用RETF返回（反其道行之）
		
    }
}
int main()
{
	printf("%x",&test);
	getchar();
    _asm
    {
        int 32;//32编号对应位置的中断门段描述符为0040ee00`0008100f
		sub esp,4//因为RETF在返回后还会再add ESP，4（根据RETF 0x4）
    }
    getchar();
    return 0;
}
```

###### 调用门用iretd 返回

```cpp
#include"stdafx.h"
#include "stdio.h"
#include <windows.h>
void __declspec(naked) test()
{
	_asm
    {
        iretd//调用门用iretd返回（反其道行之）
    }
}
int main()
{
	char buff[6]={0x78,0x56,0x34,0x12,0x48,0};//指向的调用门描述符为0040EC01`0008100F
	printf("%x",&test);
	getchar();
    _asm
    {
        call fword ptr[buff];
    }
    getchar();
    return 0;
}
```

## 陷阱门

![image-20210808163723779](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210808163723779.png)

陷阱门段描述符：XXXXEF00`XXXXXXXX

**陷阱门与中断门几乎一样**，陷阱门与中断门唯一的区别：

中断门执行时，会将**IF**位清零，但陷阱门不会。

IF位：eflags下标为9的位置。

![1342712354_1402](https://gitee.com/ZEROKO14/blog-img/raw/master/img/1342712354_1402.jpg)

**IF的含义：**

IF标志用于控制处理器对可屏蔽中断请求的响应。置1以响应可屏蔽中断，反之则禁止可屏蔽中断。

- IF=0	CPU不再接受可屏蔽中断
- IF=1	CPU接受可屏蔽中断

`p.s.不可屏蔽中断不受IF位影响，比如说断电，就是电源通过电源管理器向CPU发送一个请求，这就是一个不可屏蔽中断。(CPU有电容，即使是断电了也能跑一会儿，执行一些清理工作)`

**通过中断门与陷阱门打印EFLAG寄存器的值**

- 执行前：216
- 执行中
  1. 陷阱门：216
  2. 中断门：16

## 任务段TSS(难点非重点)

在调用门，中断门与陷阱门中，一旦出现权限切换，那么就会有堆栈的切换。而且，由于CS的CPL发生改变，也导致了SS也必须要切换。(CS和SS的权限级别永远都是一致的)

切换时，会有新的ESP和SS（CS是由中断门或者调用门指定）这2个值从哪里来的呢？

答案：**TSS**（Task-state segment），任务状态段。

### TSS和TR寄存器

一块**大于等于104字节**的内存结构。（强调：不在CPU中，就是内存中）

![196406-20200102102107308-1624147754](https://gitee.com/ZEROKO14/blog-img/raw/master/img/196406-20200102102107308-1624147754.png)

I/O权限位图：I/O Map Base Address（没什么用，和硬件是相关的）

CR3：页目录基地址寄存器CR3（PDBR）

 指向前一个任务段（TSS）的链接（**如果不为空的话，存的是前一个TSS段的段选择子**）：Previous Task Link

LDT Segment Selector：LDT段选择子,会加载到LDTR寄存器中。

tss中的ss0,ss1,ss2修改是没用的，即使修改了，也会变回去，因为是系统填写的。

一个TSS对应一个LDT表。LDTR描述的是LDT表的地址和大小。

![48588_1282618334lclL](https://gitee.com/ZEROKO14/blog-img/raw/master/img/48588_1282618334lclL.jpg)

LDT和GDT从本质上说是相同的，只是LDT嵌套在GDT之中。LDTR记录局部描述符表的起始位置，**与GDTR不同LDTR的内容是一个段选择子**。由于LDT本身同样是一段内存，也是一个段，所以它也有个描述符描述它，这个描述符就存储在GDT中，对应这个描述符也会有一个选择子，LDTR装载的就是这样一个选择子。LDTR可以在程序中随时改变，通过使用lldt指令。如上图，如果装载的是Selector 2则LDTR指向的是表LDT2。

LDT描述符

![image-20210813135407001](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210813135407001.png)

windows 32位以后实际上没有使用LDT。因为用不着这么多段了

更多关于LDT的内容可以[参考此处](http://www.techbulo.com/708.html)

```cpp
nt!_KTSS
+0x000 Backlink : Uint2B
+0x002 Reserved0 : Uint2B
+0x004 Esp0 : Uint4B
+0x008 Ss0 : Uint2B
+0x00a Reserved1 : Uint2B
+0x00c NotUsed1 : [4] Uint4B
+0x01c CR3 : Uint4B//重点寄存器CR3，后续会讲
+0x020 Eip : Uint4B
+0x024 EFlags : Uint4B
+0x028 Eax : Uint4B
+0x02c Ecx : Uint4B
+0x030 Edx : Uint4B
+0x034 Ebx : Uint4B
+0x038 Esp : Uint4B
+0x03c Ebp : Uint4B
+0x040 Esi : Uint4B
+0x044 Edi : Uint4B
+0x048 Es : Uint2B
+0x04a Reserved2 : Uint2B
+0x04c Cs : Uint2B
+0x04e Reserved3 : Uint2B
+0x050 Ss : Uint2B
+0x052 Reserved4 : Uint2B
+0x054 Ds : Uint2B
+0x056 Reserved5 : Uint2B
+0x058 Fs : Uint2B
+0x05a Reserved6 : Uint2B
+0x05c Gs : Uint2B
+0x05e Reserved7 : Uint2B
+0x060 LDT : Uint2B
+0x062 Reserved8 : Uint2B
+0x064 Flags : Uint2B
+0x066 IoMapBase : Uint2B
+0x068 IoMaps : [1] _KiIoAccessMap
+0x208c IntDirectionMap : [32] UChar
```

 *TSS的地址就是TSS段描述符描述的基地址，因此我们通过 dg tr 查看其Base为 80042000。*对于查看TSS段，有一个单独的指令。

```cpp
dg tr
dt _KTSS 80042000//Base
```

![image-20210813144727834](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210813144727834.png)![image-20210813144750275](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210813144750275.png)

#### TSS的作用

CPU层面的**任务**就是系统层面上的**线程**

**Intel CPU设计思想的初衷**：TSS就是实现任务切换（操作系统中也就是线程切换，CPU中没有线程的概念）

**操作系统的设计思想**：TSS的任务切换在操作系统中其实就是同时换掉”一堆“寄存器，与线程切换无关。windows和linux系统实际上只使用了ss和esp.

本质：**不要把TSS与“线程切换“联系到一起**，TSS的意义仅在于可以同时换掉”一堆“寄存器

#### CPU是如何找到TSS的

![image-20210808175145728](https://gitee.com/ZEROKO14/blog-img/raw/master/img/image-20210808175145728.png)

> 任务寄存器TR，16位寄存器。  其内保存的是任务状态段**TSS的16位段选择子**。每项任务都配有一个任务状态段TSS，用来描述该任务的运行状态。就用16位的选择子来检索任务状态段。总是将当前任务的TSS的选择符放在TR中，而TSS的描述符放在TSS描述符高速缓冲寄存器中（**就是段描述符除了16位的端选择子部分的其他80位**）(针对这句话一下说明)。
>
