---
title: 系统调用
tags: 内核相关
categories: 技术
abbrlink: 4f5d4e8d
---

# API函数的调用过程

Application Programming Interface,简称API函数。

<!-- more -->

Windows有多少个API：主要是存放在C:/WINDOWS/system32下的所有dll

几个重要的DLL

- **Kernel32.dll**：最核心的功能模块，比如管理内存，进程，线程相关的函数等。
- **User32.dll**：是Windows用户界面相关应用程序接口，如创建窗口和发送消息等。
- **GDI32.dll**：全称是Graphical Device Interface(图形设备接口)，包含用于画图和显示文本的函数。比如要显示一个程序窗口，就调用其中的函数来画这个窗口
- **Ntdll.dll**：大多数API都会通过这个DLL进入内核（0环）

## 3环部分

### **分析ReadProcessMemory**

```c
.text:7C8021D0 ; Exported entry 682. ReadProcessMemory
.text:7C8021D0
.text:7C8021D0 ; =============== S U B R O U T I N E =======================================
.text:7C8021D0
.text:7C8021D0 ; Attributes: bp-based frame
.text:7C8021D0
.text:7C8021D0 ; BOOL __stdcall ReadProcessMemory(HANDLE hProcess, LPCVOID lpBaseAddress, LPVOID lpBuffer, SIZE_T nSize, SIZE_T *lpNumberOfBytesRead)
.text:7C8021D0                 public _ReadProcessMemory@20
.text:7C8021D0 _ReadProcessMemory@20 proc near         ; CODE XREF: GetProcessVersion(x)+2F12F↓p
.text:7C8021D0                                         ; GetProcessVersion(x)+2F14E↓p ...
.text:7C8021D0
.text:7C8021D0 hProcess        = dword ptr  8
.text:7C8021D0 lpBaseAddress   = dword ptr  0Ch
.text:7C8021D0 lpBuffer        = dword ptr  10h
.text:7C8021D0 nSize           = dword ptr  14h
.text:7C8021D0 lpNumberOfBytesRead= dword ptr  18h
.text:7C8021D0
.text:7C8021D0                 mov     edi, edi
.text:7C8021D2                 push    ebp

.text:7C8021FD ; ---------------------------------------------------------------------------
.text:7C8021FD
.text:7C8021FD loc_7C8021FD:                           ; CODE XREF: ReadProcessMemory(x,x,x,x,x)+20↑j
.text:7C8021FD                 mov     edx, [ebp+nSize]
.text:7C802200                 mov     [ecx], edx
.text:7C802202                 jmp     short loc_7C8021F2
.text:7C802204 ; ---------------------------------------------------------------------------
.text:7C802204
.text:7C802204 loc_7C802204:                           ; CODE XREF: ReadProcessMemory(x,x,x,x,x)+24↑j
.text:7C802204                 push    eax             ; Status
.text:7C802205                 call    _BaseSetLastNTError@4 ; BaseSetLastNTError(x)
.text:7C80220A                 xor     eax, eax
.text:7C80220C                 jmp     short loc_7C8021F9
.text:7C80220C _ReadProcessMemory@20 endp
//通篇流程基本上就是调用了NtReadVirtualMemory函数
```

ReadProcessMemory->NtReadVirtualMemory

ntdll.dll中的NtReadVirtualMemory函数

```c
.text:7C92D9E0 ; __stdcall NtReadVirtualMemory(x, x, x, x, x)
.text:7C92D9E0                 public _NtReadVirtualMemory@20
.text:7C92D9E0 _NtReadVirtualMemory@20 proc near       ; CODE XREF: LdrFindCreateProcessManifest(x,x,x,x,x)+1CC↓p
.text:7C92D9E0                                         ; LdrCreateOutOfProcessImage(x,x,x,x)+7C↓p ...
.text:7C92D9E0                 mov     eax, 0BAh       ; NtReadVirtualMemory//操作系统内核函数的编号
.text:7C92D9E5                 mov     edx, 7FFE0300h//存放函数地址的地址，这个值决定了我们用什么方式进入零环
.text:7C92D9EA                 call    dword ptr [edx]
.text:7C92D9EC                 retn    14h
.text:7C92D9EC _NtReadVirtualMemory@20 endp
```

NtReadVirtualMemory就是提供一个编号，找到一个函数，通过这个函数进零环。

**7FFE0300h这个地址存放着系统调用进零环的函数地址**

#### 课后练习：

自己编写WriteProcessMemory函数(不使用任何DLL，直接调用0环函数)，并在代码中使用。

重写API的意义：自己实现API，可避免三环恶意挂钩

```c
#include"stdafx.h"
#include <stdio.h>
#include <stdlib.h>
#include <Windows.h>

void __stdcall myWriteProcessMemory(
  HANDLE  hProcess,
  LPVOID  lpBaseAddress,
  LPCVOID lpBuffer,
  SIZE_T  nSize,
  SIZE_T  *lpNumberOfBytesWritten
)
{
	__asm
	{
		push lpNumberOfBytesWritten;
		push nSize;
		push lpBuffer;
		push lpBaseAddress;
		push hProcess;
		mov eax,0x115;//写内存对应的系统服务号
		lea edx,dword ptr [esp];
		int 0x2E;
		add esp,0x14;//平栈
	}	
}

void main()
{
	int a=300;
	SIZE_T haveRead;
	HANDLE hProcess=OpenProcess(PROCESS_ALL_ACCESS,NULL,1520);
	myWriteProcessMemory(hProcess,(LPVOID)0x12ff7c,&a,4,&haveRead);
	system("pause");
}
```

目标修改进程：![image-20210902143222155](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210902143222155.png)

![image-20210902143202632](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210902143202632.png)

## 3环进0环

### _KUSER_SHARED_DATA结构

1. 在User层和Kernel层分别定义了一个_KUSER_SHARED_DATA结构区域，用于User层和Kernel层**共享**某些数据。
2. 它们使用固定的地址值映射，_KUSER_SHARED_DATA结构区域在User和Kernel层地址分别为：
   - ​	**User层地址为：0x7FFE0000**
   - ​	**Kernel层地址为：0xFFDF0000**

0x7FFE0000和0xFFDF0000指向的是同一个物理页，但**User层只读，Kernel可写**

```c
ntdll!_KUSER_SHARED_DATA
   +0x000 TickCountLow     : Uint4B
   +0x004 TickCountMultiplier : Uint4B
   +0x008 InterruptTime    : _KSYSTEM_TIME
   +0x014 SystemTime       : _KSYSTEM_TIME
   +0x020 TimeZoneBias     : _KSYSTEM_TIME
   +0x02c ImageNumberLow   : Uint2B
   +0x02e ImageNumberHigh  : Uint2B
   +0x030 NtSystemRoot     : [260] Uint2B
   +0x238 MaxStackTraceDepth : Uint4B
   +0x23c CryptoExponent   : Uint4B
   +0x240 TimeZoneId       : Uint4B
   +0x244 Reserved2        : [8] Uint4B
   +0x264 NtProductType    : _NT_PRODUCT_TYPE
   +0x268 ProductTypeIsValid : UChar
   +0x26c NtMajorVersion   : Uint4B//NT内核的主版本号
   +0x270 NtMinorVersion   : Uint4B//NT内核的次版本号
   +0x274 ProcessorFeatures : [64] UChar
   +0x2b4 Reserved1        : Uint4B
   +0x2b8 Reserved3        : Uint4B
   +0x2bc TimeSlip         : Uint4B
   +0x2c0 AlternativeArchitecture : _ALTERNATIVE_ARCHITECTURE_TYPE
   +0x2c8 SystemExpirationDate : _LARGE_INTEGER
   +0x2d0 SuiteMask        : Uint4B
   +0x2d4 KdDebuggerEnabled : UChar
   +0x2d5 NXSupportPolicy  : UChar
   +0x2d8 ActiveConsoleId  : Uint4B
   +0x2dc DismountCount    : Uint4B
   +0x2e0 ComPlusPackage   : Uint4B
   +0x2e4 LastSystemRITEventTickCount : Uint4B
   +0x2e8 NumberOfPhysicalPages : Uint4B
   +0x2ec SafeBootMode     : UChar
   +0x2f0 TraceLogging     : Uint4B
   +0x2f8 TestRetInstruction : Uint8B
   +0x300 SystemCall       : Uint4B//系统调用的方式，存放KiFastSystemCall或KiIntSystemCall地址
   +0x304 SystemCallReturn : Uint4B//快速调用的返回地址
   +0x308 SystemCallPad    : [3] Uint8B
   +0x320 TickCount        : _KSYSTEM_TIME
   +0x320 TickCountQuad    : Uint8B
   +0x330 Cookie           : Uint4B
       
//实例
ntdll!_KUSER_SHARED_DATA
   +0x000 TickCountLow     : 0xb752
   +0x004 TickCountMultiplier : 0xfa00000
   +0x008 InterruptTime    : _KSYSTEM_TIME
   +0x014 SystemTime       : _KSYSTEM_TIME
   +0x020 TimeZoneBias     : _KSYSTEM_TIME
   +0x02c ImageNumberLow   : 0x14c
   +0x02e ImageNumberHigh  : 0x14c
   +0x030 NtSystemRoot     : [260] 0x43
   +0x238 MaxStackTraceDepth : 0
   +0x23c CryptoExponent   : 0
   +0x240 TimeZoneId       : 0
   +0x244 Reserved2        : [8] 0
   +0x264 NtProductType    : 1 ( NtProductWinNt )
   +0x268 ProductTypeIsValid : 0x1 ''
   +0x26c NtMajorVersion   : 5//NT内核的主版本号
   +0x270 NtMinorVersion   : 1//NT内核的次版本号
   +0x274 ProcessorFeatures : [64]  ""
   +0x2b4 Reserved1        : 0x7ffeffff
   +0x2b8 Reserved3        : 0x80000000
   +0x2bc TimeSlip         : 0
   +0x2c0 AlternativeArchitecture : 0 ( StandardDesign )
   +0x2c8 SystemExpirationDate : _LARGE_INTEGER 0x0
   +0x2d0 SuiteMask        : 0x110
   +0x2d4 KdDebuggerEnabled : 0x3 ''
   +0x2d5 NXSupportPolicy  : 0x2 ''
   +0x2d8 ActiveConsoleId  : 0
   +0x2dc DismountCount    : 0
   +0x2e0 ComPlusPackage   : 0xffffffff
   +0x2e4 LastSystemRITEventTickCount : 0xadbe8
   +0x2e8 NumberOfPhysicalPages : 0x1ff6a
   +0x2ec SafeBootMode     : 0 ''
   +0x2f0 TraceLogging     : 0
   +0x2f8 TestRetInstruction : 0xc3
   +0x300 SystemCall       : 0x7c92e4f0//系统调用的方式，存放
   +0x304 SystemCallReturn : 0x7c92e4f4//快速调用的返回地址
   +0x308 SystemCallPad    : [3] 0
   +0x320 TickCount        : _KSYSTEM_TIME
   +0x320 TickCountQuad    : 0
   +0x330 Cookie           : 0xbde19661

```

0x7FFE0300存储的到底是什么？

两种情况：是否支持快速调用

当通过**eax=1来执行cpuid指令时**，处理器的特征信息被放在ecx和edx寄存器中，其中edx包含了一个**SEP位(0开始第11位)**，该位指明了**当前处理器是否支持systenter/sysexit指令**

- 1==支持------>ntdll.dll!KiFastSystemCall()
- 0==不支持--->ntdll.dll!KiIntSystemCall()

0x7FFE0300存储的就是上诉两个函数地址之一

> **3环进0环需要更改哪些寄存器**
>
> 1. CS的权限由3变为0，意味着需要新的**CS**
> 2. SS与CS的权限永远一致，因此需要新的**SS**
> 3. 权限发生切换的时候，堆栈也一定会切换，需要新的**ESP**
> 4. 进0环后代码的位置，因此需要**EIP**

p.s. windbg进入指定进程空间命令：

```c
.process 0xXXXXXXXX(!process 0 0遍历出来的每个PROCESS的第一个数值)
```

### KiFastSystemCall与KiIntSystemCall的区别

#### KiIntSystemCall

```c
//KiIntSystemCall
.text:7C92E500 ; _DWORD __stdcall KiIntSystemCall()
.text:7C92E500                 public _KiIntSystemCall@0
.text:7C92E500 _KiIntSystemCall@0 proc near            ; DATA XREF: .text:off_7C923428↑o
.text:7C92E500
.text:7C92E500 arg_4           = byte ptr  8
.text:7C92E500							//eax是内核函数的编号，系统调用号
.text:7C92E500                 lea     edx, [esp+arg_4]//edx说明参数在哪里
.text:7C92E504                 int     2Eh             ; DOS 2+ internal - EXECUTE COMMAND//中断门进内核
.text:7C92E504                                         ; DS:SI -> counted CR-terminated command string
.text:7C92E506                 retn
.text:7C92E506 _KiIntSystemCall@0 endp
```

**分析INT 0x2E进0环**

1. 在IDT表中找到0x2E

   ![image-20210831143046585](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210831143046585.png)

2. 分析CS/SS/ESP/EIP

   ee表明是个中断门描述符，CS是0x0008，EIP为0x8053E481

   ![image-20210831155837942](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210831155837942.png)

3. 分析EIP是什么

   ```c
   //只取开头部分
   kd> u 8053e481
   nt!KiSystemService:
   8053e481 6a00            push    0
   8053e483 55              push    ebp
   8053e484 53              push    ebx
   8053e485 56              push    esi
   8053e486 57              push    edi
   8053e487 0fa0            push    fs
   8053e489 bb30000000      mov     ebx,30h
   8053e48e 668ee3          mov     fs,bx
   ```

此时KiSystemService函数才真正是内核函数

------
#### KiFastSystemCall

```c
//KiFastSystemCall
.text:7C92E4F0 ; _DWORD __stdcall KiFastSystemCall()
.text:7C92E4F0                 public _KiFastSystemCall@0
.text:7C92E4F0 _KiFastSystemCall@0 proc near           ; DATA XREF: .text:off_7C923428↑o
.text:7C92E4F0                 mov     edx, esp//3环栈顶esp放到edx中 //系统调用号在eax寄存器
.text:7C92E4F2                 sysenter//快速调用进内核
.text:7C92E4F2 _KiFastSystemCall@0 endp
.text:7C92E4F2
.text:7C92E4F4 ; Exported entry  42. KiFastSystemCallRet
.text:7C92E4F4
.text:7C92E4F4 ; =============== S U B R O U T I N E =======================================
.text:7C92E4F4
.text:7C92E4F4
.text:7C92E4F4 ; _DWORD __stdcall KiFastSystemCallRet()
.text:7C92E4F4                 public _KiFastSystemCallRet@0
.text:7C92E4F4 _KiFastSystemCallRet@0 proc near        ; DATA XREF: .text:off_7C923428↑o
.text:7C92E4F4                 retn
.text:7C92E4F4 _KiFastSystemCallRet@0 endp
```

**什么叫快速调用？**

- 中断门进0环，需要的CS，EIP在IDT表中，需要查内存(SS与ESP由TSS提供)
- 而CPU如果支持sysenter指令时，操作系统会提前将CS/SS/ESP/EIP的值存储在**MSR寄存器**中，sysenter指令执行时，CPU会将MSR寄存器中的值直接写入相关寄存器，没有读内存的过程，所以叫快速调用，但本质都是切换CS,SS,ESP,EIP。

**分析sysenter进0环**

在**执行sysenter指令之前，操作系统必须指定0环的CS段，SS段，EIP以及ESP**。sysenter是由CPU设计规定并操作的

| MSR               | 地址 |
| ----------------- | ---- |
| IA32_SYSENTER_CS  | 174H |
| IA32_SYSENTER_ESP | 175H |
| IA32_SYSENTER_EIP | 176H |

**SS**是通过【IA32_SYSENTER_CS+8】的段选择子来计算出来的。即CS是0x08指向的段，SS就是gdt中0x08指向的段描述符的下一个段描述符。

vt，MSR结构非常重要。

intel文档上说该指令是为了快速的系统调用（从ring3 到ring0），在执行sysenter之前了，必须要设置好ring0中的代码段、入口函数地址、ring0栈所在的段、栈指针，设置方式是写下列MSRs：

- IA32_SYSENTER_CS:32bit，前16个字节为代码段选择符，其确定的索引+1为栈段的索引，所以在全局描述符表中这两个必须相连。
- IA32_SYSENTER_EIP:32bit，入口指令地址。
- IA32_SYSENTER_ESP:32bit，内核栈地址。

**可以通过RDMSR/WRMST来进行读写(操作系统使用WRMST写该寄存器)：**

![image-20210831145044898](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210831145044898.png)

参考：Intel白皮书第二卷（搜索sysenter）

当执行**SYSENTER**，处理器会做下面的动作：

1. 从IA32_SYSENTER_CS从取出段选择子加载到CS中。

2. 从IA32_SYSENTER_EIP取出指令指针放到EIP中

3. 将IA32_SYSENTER_CS的值加上8，将其结果加载到SS中。

4. 从IA32_SYSENTER_ESP取出堆栈指针放到ESP寄存器中

上述步骤相当于**切换到0环的_KiFastCallEntry函数**  

EIP指向的代码：

```c
//只取开头部分
kd> u 8053e540
nt!KiFastCallEntry:
8053e540 b923000000      mov     ecx,23h
8053e545 6a30            push    30h
8053e547 0fa1            pop     fs
8053e549 8ed9            mov     ds,cx
8053e54b 8ec1            mov     es,cx
8053e54d 8b0d40f0dfff    mov     ecx,dword ptr ds:[0FFDFF040h]
8053e553 8b6104          mov     esp,dword ptr [ecx+4]
8053e556 6a23            push    23h
```

可见，进入了KiFastCallEntry内核函数。

### API进零环的两种方式总结

- API通过**中断门**进0环
  1. 固定中断号为0x2E
  2. CS/EIP由门描述符提供，ESP/SS由TSS提供
  3. 进入0环后执行的内核函数：**NT!KiStstemService**
- API通过**sysenter**指令进入0环
  1. CS/ESP/EIP由MSR寄存器提供（SS是算出来的）（实际上逆向时ESP还是由TSS中来）
  2. 进入0环后执行的内核函数：**NT!KiFastCallEntry**

winXP内核模块：ntoskrnl.exe(10-10-12分页)/ntkrnlpa.exe(2-9-9-12分页)

![image-20210902143436444](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210902143436444.png)

KiFastSystemCall方式三环进0环，TerminateThread API进入流程（未记录返回部分）：

![image-20211028194257701](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20211028194257701.png)

### 思考

自己实现通过中断门直接调用内核函数

通过IDA找到KiStstemService和KiFastCallEntry函数并分析

1. 进0环后，原来的寄存器存在哪里？
2. 如何根据系统调用号（eax中存储）找到要执行的内核函数？
3. 调用时参数时存储到3环的堆栈，如何传递给内核函数？
4. 两种调用方式分别是如何返回到3环的

后续的章节会展开讲上面的点。

## 内核结构体介绍

1. 储存3环寄存器信息结构体：_Ktrap_frame结构体
2. 描述线程相关信息结构体：\_ETHREAD和\_KTHREAD
3. 描述当前CPU状态的结构体：_KPCR

### _Ktrap_frame结构体

陷阱帧

无论是通过sysenter还是通过中断门进入零环，**三环所有寄存器都会存在这个结构中**。

该结构是**零环结构体，由操作系统进行维护**。

```c
kd> dt _Ktrap_frame
ntdll!_KTRAP_FRAME
   +0x000 DbgEbp           : Uint4B
   +0x004 DbgEip           : Uint4B
   +0x008 DbgArgMark       : Uint4B
   +0x00c DbgArgPointer    : Uint4B
   +0x010 TempSegCs        : Uint4B
   +0x014 TempEsp          : Uint4B
   +0x018 Dr0              : Uint4B
   +0x01c Dr1              : Uint4B
   +0x020 Dr2              : Uint4B
   +0x024 Dr3              : Uint4B
   +0x028 Dr6              : Uint4B
   +0x02c Dr7              : Uint4B
   +0x030 SegGs            : Uint4B
   +0x034 SegEs            : Uint4B
   +0x038 SegDs            : Uint4B
   +0x03c Edx              : Uint4B
   +0x040 Ecx              : Uint4B
   +0x044 Eax              : Uint4B
   +0x048 PreviousPreviousMode : Uint4B
   +0x04c ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD
   +0x050 SegFs            : Uint4B
   +0x054 Edi              : Uint4B
   +0x058 Esi              : Uint4B
   +0x05c Ebx              : Uint4B
   +0x060 Ebp              : Uint4B
   +0x064 ErrCode          : Uint4B
   +0x068 Eip              : Uint4B
   +0x06c SegCs            : Uint4B
   +0x070 EFlags           : Uint4B
   +0x074 HardwareEsp      : Uint4B
   +0x078 HardwareSegSs    : Uint4B
   +0x07c V86Es            : Uint4B
   +0x080 V86Ds            : Uint4B
   +0x084 V86Fs            : Uint4B
   +0x088 V86Gs            : Uint4B

```

![image-20210831191749044](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210831191749044.png)

- KiFastSystemCall由0x78开始往上压栈。(sysenter)
- KiIntSystemCall由0x64开始往上压栈。(中断)

### THREAD线程相关的结构体

![image-20210831191949142](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210831191949142.png)

#### _ETHREAD结构体

每个线程在零环都有一个对应的_ETHREAD结构体

```c
ntdll!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x1c0 CreateTime       : _LARGE_INTEGER
   +0x1c0 NestedFaultCount : Pos 0, 2 Bits
   +0x1c0 ApcNeeded        : Pos 2, 1 Bit
   +0x1c8 ExitTime         : _LARGE_INTEGER
   +0x1c8 LpcReplyChain    : _LIST_ENTRY
   +0x1c8 KeyedWaitChain   : _LIST_ENTRY
   +0x1d0 ExitStatus       : Int4B
   +0x1d0 OfsChain         : Ptr32 Void
   +0x1d4 PostBlockList    : _LIST_ENTRY
   +0x1dc TerminationPort  : Ptr32 _TERMINATION_PORT
   +0x1dc ReaperLink       : Ptr32 _ETHREAD
   +0x1dc KeyedWaitValue   : Ptr32 Void
   +0x1e0 ActiveTimerListLock : Uint4B
   +0x1e4 ActiveTimerListHead : _LIST_ENTRY
   +0x1ec Cid              : _CLIENT_ID
   +0x1f4 LpcReplySemaphore : _KSEMAPHORE
   +0x1f4 KeyedWaitSemaphore : _KSEMAPHORE
   +0x208 LpcReplyMessage  : Ptr32 Void
   +0x208 LpcWaitingOnPort : Ptr32 Void
   +0x20c ImpersonationInfo : Ptr32 _PS_IMPERSONATION_INFORMATION
   +0x210 IrpList          : _LIST_ENTRY
   +0x218 TopLevelIrp      : Uint4B
   +0x21c DeviceToVerify   : Ptr32 _DEVICE_OBJECT
   +0x220 ThreadsProcess   : Ptr32 _EPROCESS
   +0x224 StartAddress     : Ptr32 Void
   +0x228 Win32StartAddress : Ptr32 Void
   +0x228 LpcReceivedMessageId : Uint4B
   +0x22c ThreadListEntry  : _LIST_ENTRY
   +0x234 RundownProtect   : _EX_RUNDOWN_REF
   +0x238 ThreadLock       : _EX_PUSH_LOCK
   +0x23c LpcReplyMessageId : Uint4B
   +0x240 ReadClusterSize  : Uint4B
   +0x244 GrantedAccess    : Uint4B
   +0x248 CrossThreadFlags : Uint4B
   +0x248 Terminated       : Pos 0, 1 Bit
   +0x248 DeadThread       : Pos 1, 1 Bit
   +0x248 HideFromDebugger : Pos 2, 1 Bit
   +0x248 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x248 SystemThread     : Pos 4, 1 Bit
   +0x248 HardErrorsAreDisabled : Pos 5, 1 Bit
   +0x248 BreakOnTermination : Pos 6, 1 Bit
   +0x248 SkipCreationMsg  : Pos 7, 1 Bit
   +0x248 SkipTerminationMsg : Pos 8, 1 Bit
   +0x24c SameThreadPassiveFlags : Uint4B
   +0x24c ActiveExWorker   : Pos 0, 1 Bit
   +0x24c ExWorkerCanWaitUser : Pos 1, 1 Bit
   +0x24c MemoryMaker      : Pos 2, 1 Bit
   +0x250 SameThreadApcFlags : Uint4B
   +0x250 LpcReceivedMsgIdValid : Pos 0, 1 Bit
   +0x250 LpcExitThreadCalled : Pos 1, 1 Bit
   +0x250 AddressSpaceOwner : Pos 2, 1 Bit
   +0x254 ForwardClusterOnly : UChar
   +0x255 DisablePageFaultClustering : UChar
```

#### _KTHREAD结构体

_ETHRAD结构体中的子结构体，存储的都是相对比较重要的信息：

```c
ntdll!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 MutantListHead   : _LIST_ENTRY
   +0x018 InitialStack     : Ptr32 Void
   +0x01c StackLimit       : Ptr32 Void
   +0x020 Teb              : Ptr32 Void
   +0x024 TlsArray         : Ptr32 Void
   +0x028 KernelStack      : Ptr32 Void
   +0x02c DebugActive      : UChar
   +0x02d State            : UChar
   +0x02e Alerted          : [2] UChar
   +0x030 Iopl             : UChar
   +0x031 NpxState         : UChar
   +0x032 Saturation       : Char
   +0x033 Priority         : Char
   +0x034 ApcState         : _KAPC_STATE
   +0x04c ContextSwitches  : Uint4B
   +0x050 IdleSwapBlock    : UChar
   +0x051 Spare0           : [3] UChar
   +0x054 WaitStatus       : Int4B
   +0x058 WaitIrql         : UChar
   +0x059 WaitMode         : Char
   +0x05a WaitNext         : UChar
   +0x05b WaitReason       : UChar
   +0x05c WaitBlockList    : Ptr32 _KWAIT_BLOCK
   +0x060 WaitListEntry    : _LIST_ENTRY
   +0x060 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x068 WaitTime         : Uint4B
   +0x06c BasePriority     : Char
   +0x06d DecrementCount   : UChar
   +0x06e PriorityDecrement : Char
   +0x06f Quantum          : Char
   +0x070 WaitBlock        : [4] _KWAIT_BLOCK
   +0x0d0 LegoData         : Ptr32 Void
   +0x0d4 KernelApcDisable : Uint4B
   +0x0d8 UserAffinity     : Uint4B
   +0x0dc SystemAffinityActive : UChar
   +0x0dd PowerState       : UChar
   +0x0de NpxIrql          : UChar
   +0x0df InitialNode      : UChar
   +0x0e0 ServiceTable     : Ptr32 Void
   +0x0e4 Queue            : Ptr32 _KQUEUE
   +0x0e8 ApcQueueLock     : Uint4B
   +0x0f0 Timer            : _KTIMER
   +0x118 QueueListEntry   : _LIST_ENTRY
   +0x120 SoftAffinity     : Uint4B
   +0x124 Affinity         : Uint4B
   +0x128 Preempted        : UChar
   +0x129 ProcessReadyQueue : UChar
   +0x12a KernelStackResident : UChar
   +0x12b NextProcessor    : UChar
   +0x12c CallbackStack    : Ptr32 Void
   +0x130 Win32Thread      : Ptr32 Void
   +0x134 TrapFrame        : Ptr32 _KTRAP_FRAME
   +0x138 ApcStatePointer  : [2] Ptr32 _KAPC_STATE
   +0x140 PreviousMode     : Char//先前模式，从用户模式调用Native API则previous mode是1，如果从内核模式调用Native API则previous mode是0
   +0x141 EnableStackSwap  : UChar
   +0x142 LargeStack       : UChar
   +0x143 ResourceIndex    : UChar
   +0x144 KernelTime       : Uint4B
   +0x148 UserTime         : Uint4B
   +0x14c SavedApcState    : _KAPC_STATE
   +0x164 Alertable        : UChar
   +0x165 ApcStateIndex    : UChar
   +0x166 ApcQueueable     : UChar
   +0x167 AutoAlignment    : UChar
   +0x168 StackBase        : Ptr32 Void
   +0x16c SuspendApc       : _KAPC
   +0x19c SuspendSemaphore : _KSEMAPHORE
   +0x1b0 ThreadListEntry  : _LIST_ENTRY
   +0x1b8 FreezeCount      : Char
   +0x1b9 SuspendCount     : Char
   +0x1ba IdealProcessor   : UChar
   +0x1bb DisableBoost     : UChar
```

### CPU相关结构体

#### CPU相关windbg指令

##### 查看CPU数量

```c
dd KeNumberProcessors
```

![image-20210831151847441](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210831151847441.png)

表示一核

##### 查看KPRCB存在哪里

```c
dd KiProcessorBlock
```

![image-20210831152107988](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210831152107988.png)

如果有两个核，那么就会出现两个地址，上图由于只有一个核所以还有一个地址。

120为kpcr中KPRCB的对应位置，0xffdff120-0x120就是_kpcr结构体的地址。

p.s. 在0环中，FS段描述符指向的就是KPCR结构首地址，写死在gdtr+0x30位置。

**查看kpcr指令：**

```c
dt _kpcr 0xffdff120-0x120
```

#### _KPCR结构体

![image-20210831191911557](https://cdn.jsdelivr.net/gh/che77a38/blogImage/image-20210831191911557.png)

KPCR 也叫CPU控制区(Processor Control Region)

每一个CPU核都有一个_KPCR结构体来描述当前CPU所处的状态。

```c
kd> dt _kpcr 0xffdff120-0x120
nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x01c SelfPcr          : 0xffdff000 _KPCR
   +0x020 Prcb             : 0xffdff120 _KPRCB
   +0x024 Irql             : 0 ''
   +0x028 IRR              : 0
   +0x02c IrrActive        : 0
   +0x030 IDR              : 0xffffffff
   +0x034 KdVersionBlock   : 0x80546ab8 Void
   +0x038 IDT              : 0x8003f400 _KIDTENTRY//当前核的IDT
   +0x03c GDT              : 0x8003f000 _KGDTENTRY//当前核的GDT
   +0x040 TSS              : 0x80042000 _KTSS//当前核的TSS
   +0x044 MajorVersion     : 1
   +0x046 MinorVersion     : 1
   +0x048 SetMember        : 1
   +0x04c StallScaleFactor : 0xd49
   +0x050 DebugActive      : 0 ''//调试激活位
   +0x051 Number           : 0 ''
   +0x052 Spare0           : 0 ''
   +0x053 SecondLevelCacheAssociativity : 0 ''
   +0x054 VdmAlert         : 0
   +0x058 KernelReserved   : [14] 0
   +0x090 SecondLevelCacheSize : 0
   +0x094 HalReserved      : [16] 0
   +0x0d4 InterruptMode    : 0
   +0x0d8 Spare1           : 0 ''
   +0x0dc KernelReserved2  : [17] 0
   +0x120 PrcbData         : _KPRCB
       
       
ntdll!_NT_TIB
   +0x000 ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD　　//当前线程内核异常链表(SEH)
   +0x004 StackBase        : Ptr32 Void　　　　　　　　　　　　　　　　　 //当前线程堆栈的基址
   +0x008 StackLimit       : Ptr32 Void　　　　　　　　　　　　　　　　　 //当前线程堆栈的大小
   +0x00c SubSystemTib     : Ptr32 Void
   +0x010 FiberData        : Ptr32 Void
   +0x010 Version          : Uint4B
   +0x014 ArbitraryUserPointer : Ptr32 Void
   +0x018 Self             : Ptr32 _NT_TIB　　　　　　　　　　　　　　　 //指向自己头部，目的为了方便查找
```

#### _KPRCB结构体

```c
kd> dt _KPRCB ffdff000+0x120
ntdll!_KPRCB
   +0x000 MinorVersion     : 1
   +0x002 MajorVersion     : 1
   +0x004 CurrentThread    : 0x80553740 _KTHREAD
   +0x008 NextThread       : (null) 
   +0x00c IdleThread       : 0x80553740 _KTHREAD
   +0x010 Number           : 0 ''
   +0x011 Reserved         : 0 ''
   +0x012 BuildType        : 2
   +0x014 SetMember        : 1
   +0x018 CpuType          : 6 ''
   +0x019 CpuID            : 1 ''
   +0x01a CpuStep          : 0x3c03
   +0x01c ProcessorState   : _KPROCESSOR_STATE
   +0x33c KernelReserved   : [16] 0
   +0x37c HalReserved      : [16] 0
   +0x3bc PrcbPad0         : [92]  ""
   +0x418 LockQueue        : [16] _KSPIN_LOCK_QUEUE
   +0x498 PrcbPad1         : [8]  ""
   +0x4a0 NpxThread        : 0x81d10af0 _KTHREAD
   +0x4a4 InterruptCount   : 0x34e1
   +0x4a8 KernelTime       : 0x1aaf
   +0x4ac UserTime         : 0xa1
   +0x4b0 DpcTime          : 0x16
   +0x4b4 DebugDpcTime     : 0
   +0x4b8 InterruptTime    : 0x79
   +0x4bc AdjustDpcThreshold : 0x14
   +0x4c0 PageColor        : 0
   +0x4c4 SkipTick         : 0
   +0x4c8 MultiThreadSetBusy : 0 ''
   +0x4c9 Spare2           : [3]  ""
   +0x4cc ParentNode       : 0x80553e00 _KNODE
   +0x4d0 MultiThreadProcessorSet : 1
   +0x4d4 MultiThreadSetMaster : (null) 
   +0x4d8 ThreadStartCount : [2] 0
   +0x4e0 CcFastReadNoWait : 0
   +0x4e4 CcFastReadWait   : 0
   +0x4e8 CcFastReadNotPossible : 0
   +0x4ec CcCopyReadNoWait : 0
   +0x4f0 CcCopyReadWait   : 0
   +0x4f4 CcCopyReadNoWaitMiss : 0
   +0x4f8 KeAlignmentFixupCount : 0
   +0x4fc KeContextSwitches : 0x1a44d
   +0x500 KeDcacheFlushCount : 0
   +0x504 KeExceptionDispatchCount : 0x290
   +0x508 KeFirstLevelTbFills : 0
   +0x50c KeFloatingEmulationCount : 0
   +0x510 KeIcacheFlushCount : 0
   +0x514 KeSecondLevelTbFills : 0
   +0x518 KeSystemCalls    : 0x24189b//系统调用次数
   +0x51c SpareCounter0    : [1] 0
   +0x520 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
   +0x5a0 PPNPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x6a0 PPPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x7a0 PacketBarrier    : 0
   +0x7a4 ReverseStall     : 0
   +0x7a8 IpiFrame         : (null) 
   +0x7ac PrcbPad2         : [52]  ""
   +0x7e0 CurrentPacket    : [3] (null) 
   +0x7ec TargetSet        : 0
   +0x7f0 WorkerRoutine    : (null) 
   +0x7f4 IpiFrozen        : 0
   +0x7f8 PrcbPad3         : [40]  ""
   +0x820 RequestSummary   : 0
   +0x824 SignalDone       : (null) 
   +0x828 PrcbPad4         : [56]  ""
   +0x860 DpcListHead      : _LIST_ENTRY [ 0x80553da4 - 0x80553da4 ]
   +0x868 DpcStack         : 0xf8ac2000 Void
   +0x86c DpcCount         : 0x2058
   +0x870 DpcQueueDepth    : 1
   +0x874 DpcRoutineActive : 0
   +0x878 DpcInterruptRequested : 0
   +0x87c DpcLastCount     : 0x2058
   +0x880 DpcRequestRate   : 0
   +0x884 MaximumDpcQueueDepth : 1
   +0x888 MinimumDpcRate   : 3
   +0x88c QuantumEnd       : 0
   +0x890 PrcbPad5         : [16]  ""
   +0x8a0 DpcLock          : 0
   +0x8a4 PrcbPad6         : [28]  ""
   +0x8c0 CallDpc          : _KDPC
   +0x8e0 ChainedInterruptList : (null) 
   +0x8e4 LookasideIrpFloat : 0n1438
   +0x8e8 SpareFields0     : [6] 0
   +0x900 VendorString     : [13]  "GenuineIntel"//CPU厂商名称
   +0x90d InitialApicId    : 0 ''
   +0x90e LogicalProcessorsPerPhysicalProcessor : 0x1 ''
   +0x910 MHz              : 0xd47
   +0x914 FeatureBits      : 0xa0013fff
   +0x918 UpdateSignature  : _LARGE_INTEGER 0x00000025`00000000
   +0x920 NpxSaveArea      : _FX_SAVE_AREA
   +0xb30 PowerState       : _PROCESSOR_POWER_STATE
```



## 分析KiStstemService和KiFastCallEntry

KiStstemService和KiFastCallEntry从两个口进来，最终执行的代码是一样的。

开始的时候，这两函数都在填充\_Ktrap\_frame结构体以保存三环的信息：

```c
kd> uf 8053e481
Flow analysis was incomplete, some code may be missing
nt!KiBBTUnexpectedRange:
8053e332 83f910          cmp     ecx,10h
8053e335 7539            jne     nt!KiBBTUnexpectedRange+0x3e (8053e370)  Branch

nt!KiBBTUnexpectedRange+0x5:
8053e337 52              push    edx
8053e338 53              push    ebx
8053e339 e8e2530800      call    nt!PsConvertToGuiThread (805c3720)
8053e33e 0bc0            or      eax,eax
8053e340 58              pop     eax
8053e341 5a              pop     edx
8053e342 8bec            mov     ebp,esp
8053e344 89ae34010000    mov     dword ptr [esi+134h],ebp
8053e34a 0f847d020000    je      nt!KiFastCallEntry+0x8d (8053e5cd)  Branch

nt!KiBBTUnexpectedRange+0x1e:
8053e350 8d15703f5580    lea     edx,[nt!KeServiceDescriptorTableShadow+0x10 (80553f70)]
