---
title: 驱动开发
tags: 内核相关
categories: 技术



---

# 驱动开发

**理解**

- SDK   software development kits(软件开发包)   如Visual Studio 2019(v142)
- WDK  windows driver development kits(驱动开发包)  如WindowsKernelModeDriver10.0

<!-- more -->

设置他们的位置在属性-配置属性-常规-平台工具集,但实际上无需手动设置,因为新建什么项目时vs都帮你自动配置好了

## 准备工作

[环境配置参考](https://blog.csdn.net/newnewman80/article/details/90754999)

创建**Empty WDM Driver**项目，生成的Driver Files文件中的**inf后缀文件**可以直接删除

在源文件中添加的必须是.c后缀的C语言文件。

项目配置中：

1. 属性-C/C++中`将警告视为错误`选项设置为否
2. 属性-链接器中`将链接器警告视为错误`设为否

由于使用的是windowsXP作为开发环境，所以要**针对windowsXP进行项目配置，参考链接**：[开发各平台驱动的设置参考](https://blog.csdn.net/Kwansy/article/details/111051265)

如果建立的是KMDF项目的话,除了上述步骤,还可以将属性-Inf2Cat中`Run Inf2Cat`选项设置为否

**制作不同系统的驱动,要设置属性-Driver Settings-Target OS Version设置为对应操作系统**

属性-Driver Settings-Target Platform设置为Desktop

**驱动的开发流程：**

编写代码->生成.sys文件->部署->启动->停止->卸载

驱动程序的测试最好在**虚拟机中**测试，因为一出问题就蓝屏

**DebugView**软件监视选项中要选上**监视核心**

驱动开发的调试：双机调试

```c
//操作系统调试驱动需要打开测试模式
bcdedit /set nointegritychecks on//关闭驱动数字证书检测
bcdedit /set testsigning on//打开测试模式
pause
shutdown -r -t 1000//一秒之后重启系统
```

无论是debug还是release版本的驱动都会带一个测试的签名,测试的签名 只在测试模式下有效.非测试模式下等于没有签名无法加载驱动.

虚拟机设置(防止待机过长屏幕自动关闭时虚拟机出现问题)

右键-显示设置-电源和随眠-屏幕定时关闭调成从不

### 设置双机调试步骤

虚拟机设置中添加串行端口

![xvniji2](https://raw.githubusercontent.com/che77a38/blogImage2/main/202205161418079.jpeg)

**红色线虽然显示是串行端口2,但实际上由于当前只有一个串行端口,所以在虚拟机系统中设置的引导的调试端口应该是com1**

然后如下,到操作系统中添加调试引导项

```c

3. 如果函数A的其中一个调用源是可能运行在多线程环境下的，或者多个调用源可能运行于不同的可并发的多线程环境，而且调用路径上没有采取多线程序列化成单线程的强制措施，则函数A也是可能运行在多线程环境的。
4. 如果函数A所有可能运行于多线程环境的调用路径上，都有多线程序列化成单线程的强制措施，则函数A是运行于单线程环境的。
5. 只使用函数内部资源的，完全不使用全局变量，静态变量或其他全局性资源的函数是多线程安全的。
6. 如果对某个全局变量或者静态变量的所有访问都被强制的同步手段限制为同一时刻只有一个线程访问，则即使使用了这些全局变量或静态变量，对函数的多线程安全性也是没有影响的。

| 调用源                   | 运行环境 | 原因                                                         |
| ------------------------ | -------- | ------------------------------------------------------------ |
| DriverEntry/DriverUnload | 单线程   | 这两个函数由系统集成的单一线程调用。不会出现多线程同时调用的情况 |
| 各种分发函数             | 多线程   | 没有任何文档保证分发函数是不会被多线程同时调用的。此外，分发函数是不会和DriverEntry并发，但可能和DriverUnload并发 |
| 完成函数                 | 多线程   | 完成函数随时可能被未知的线程调用                             |
| 各种NDIS回调函数         | 多线程   | 同上                                                         |
|                          |          |                                                              |

#### 代码的中断级

win32编程是没有中断级这个概念的，但是在内核编程中是有中断级的概念的，我们的程序好像是并发的，但其实是有优先级的，就是中断级

- passive
- dispatch

规则：

1. 如果在调用路径上没有特殊情况（导致中断级的提高或降低），则一个函数执行时的中断和它的调用源的中断级相同
2. 如果在调用路径上有获取自旋锁，则中断级随之升高；如果调用路径上有释放自旋锁，则中断级随之下降。

| 调用源                   | 一般运行中断级 |
| ------------------------ | -------------- |
| DriverUnload/DriverEntry | Passive级      |
| 各种分发函数             | Passive级      |
| 完成函数                 | Dispatch级     |
| 各种NDIS回调函数         | Dispatch级     |

#### WDK中出现的特殊代码

##### IN和OUT

```c
#define IN
#define OUT
```

空定义，只是作为提示函数中参数时输入还是输出的

##### [#pragma alloc_text](https://blog.csdn.net/analogous_love/article/details/47274559)

有时，驱动程序的某些部分必须驻留内存而另一些可以被分页，这就需要一种能控制代码和数据是否分页的方法。通过指导编译器的段分配可以实现这个目的。

#pragma alloc_text：**把驱动程序的单独例程放到特定段中。**

使编译器把代码放到特定段的传统方法是使用alloc_text编译指示。但不是每种编译器都支持这个编译指示

```c
#pragma alloc_text(PAGE, a)
#pragma alloc_text(PAGE, b)
//表示函数a和b都运行在分页内存中，就是有可能被交换到分页池中，程序中一些高等级，例如dispatch 级别的代码当然不能运行在分页内存，这样往往出现BSOD
//如果没有上述指令，则默认位于PAGELK这个节，即不会把内存放入硬盘。
```

**\#pragma alloc_text使用注意**

1. 该编译指示必须跟在函数声明后面而不能在前面。你可以把驱动程序中的所有函数集中到一个头文件中，并在包含该头文件的源文件中，在#include语句的后面使用alloc_text。
2. 该编译指示仅能用于有C连接形式的函数。即，它不能用于类成员函数或 C++源文件中未用extern “C”声明的函数。

```c
#pragma alloc_text(INIT,DriverEntry)//某些代码在驱动程序完成初始化后不再需要，可以直接把它插入到INIT段。
```









## 内核空间与内核模块

### 内核空间

![image-20210826200041917](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210826200052881.png)

**内核空间中的地址在各个进程中都是一样的。**

内核模块定义全局变量：可在不同进程中查看

**windbg进入对应进程的进程空间**：

```c
kd>!process 0 0//罗列出来的进程信息枚举，将PROCESS后接的地址放入下面的命令
kd>.process XXXXXXXX(上面获取到的地址)
//转到了对应进程的内存空间
```

### 内核模块

![image-20210826200052881](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210826200052881.png)

1. 硬件种类繁多，不可能做一个兼容所有硬件的内核，所以，微软提供规定的接口格式，让硬件驱动人员按照规定的格式编写“驱动程序”。
2. 这些驱动程序每一个都是一个模块，称为“内核模块”，都可以加载到内核中，**都遵守PE结构**。本质上讲，任意一个.sys文件与内核文件没有区别。

#### DRIVER_OBJECT结构体

定义在wdm.h中。

每个内核模块都有一个对应的结构体，来描述这个模块在内核中的各种信息：位置、大小、名称等等。

```c
kd> dt _DRIVER_OBJECT
nt!_DRIVER_OBJECT
   +0x000 Type             : Int2B//类型
   +0x002 Size             : Int2B//大小
   +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT//设备对象，这里实际上是一个设备对象的链表的开始。因为DeviceObject中有相关链表信息
   +0x008 Flags            : Uint4B
   +0x00c DriverStart      : Ptr32 Void//驱动被加载到什么地方了，即内核模块的起始地址
   +0x010 DriverSize       : Uint4B//该驱动内核模块的大小
   +0x014 DriverSection    : Ptr32 Void//指向当前驱动的_LDR_DATA_TABLE_ENTRY结构体的指针
   +0x018 DriverExtension  : Ptr32 _DRIVER_EXTENSION//热拔插会用到的相关信息
   +0x01c DriverName       : _UNICODE_STRING//驱动的名字
   +0x024 HardwareDatabase : Ptr32 _UNICODE_STRING//注册表
   +0x028 FastIoDispatch   : Ptr32 _FAST_IO_DISPATCH//某派遣函数，快速IO分发函数
   +0x02c DriverInit       : Ptr32     long //初始化派遣函数
   +0x030 DriverStartIo    : Ptr32     void //某派遣函数
   +0x034 DriverUnload     : Ptr32     void //驱动卸载派遣函数
   +0x038 MajorFunction    : [28] Ptr32     long //包含28个派遣函数地址
       //0编号的IRP对应的派遣函数的地址就存在MajorFunction[0]的位置。
////////////////////////////////_DRIVER_EXTENSION///////////////////////////
ntdll!_DRIVER_EXTENSION//热拔插驱动相关的
   +0x000 DriverObject     : Ptr32 _DRIVER_OBJECT
   +0x004 AddDevice        : Ptr32     long 
   +0x008 Count            : Uint4B
   +0x00c ServiceKeyName   : _UNICODE_STRING
   +0x014 ClientDriverExtension : Ptr32 _IO_CLIENT_EXTENSION
   +0x018 FsFilterCallbacks : Ptr32 _FS_FILTER_CALLBACKS
```

![image-20210828154104796](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210828154104796.png)

![image-20210828154124934](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210828154124934.png)

Type，Flags，MajorFunction等等，因为他们是固有特征，尽可能隐藏特征，因为内核文件已经加载到内存里了，所以即使修改了，也不影响正常运行。

#### _LDR_DATA_TABLE_ENTRY结构体

完整版定义见WRK的_KLDR_DATA_TABLE_ENTRY

```c
//所有内核模块的双向链表
kd> dt _LDR_DATA_TABLE_ENTRY
nt!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY//初始化顺序双向链表
   +0x008 InMemoryOrderLinks : _LIST_ENTRY
   +0x010 InInitializationOrderLinks : _LIST_ENTRY
   +0x018 DllBase          : Ptr32 Void//内核模块的起始地址
   +0x01c EntryPoint       : Ptr32 Void
   +0x020 SizeOfImage      : Uint4B//内核模块的大小
   +0x024 FullDllName      : _UNICODE_STRING//完整的内核模块名，实际上就是全路径
   +0x02c BaseDllName      : _UNICODE_STRING//只有内核模块名，如：xxx.sys
   +0x034 Flags            : Uint4B
   +0x038 LoadCount        : Uint2B
   +0x03a TlsIndex         : Uint2B
   +0x03c HashLinks        : _LIST_ENTRY
   +0x03c SectionPointer   : Ptr32 Void
   +0x040 CheckSum         : Uint4B//校验和
   +0x044 TimeDateStamp    : Uint4B
   +0x044 LoadedImports    : Ptr32 Void
   +0x048 EntryPointActivationContext : Ptr32 Void
   +0x04c PatchInformation : Ptr32 Void
     
     //wrk版符号结构
     #ifdef _WIN64
    typedef struct _KLDR_DATA_TABLE_ENTRY
    {
        LIST_ENTRY listEntry;
        ULONG64 __Undefined1;
        ULONG64 __Undefined2;
        ULONG64 __Undefined3;
        ULONG64 NonPagedDebugInfo;
        ULONG64 DllBase;
        ULONG64 EntryPoint;
        ULONG SizeOfImage;
        UNICODE_STRING path;
        UNICODE_STRING name;
        ULONG   Flags;
        USHORT  LoadCount;
        USHORT  __Undefined5;
        ULONG64 __Undefined6;
        ULONG   CheckSum;
        ULONG   __padding1;
        ULONG   TimeDateStamp;
        ULONG   __padding2;
    } KLDR_DATA_TABLE_ENTRY, *PKLDR_DATA_TABLE_ENTRY;
#else
    typedef struct _KLDR_DATA_TABLE_ENTRY
    {
        LIST_ENTRY listEntry;
        ULONG unknown1;
        ULONG unknown2;
        ULONG unknown3;
        ULONG unknown4;
        ULONG unknown5;
        ULONG unknown6;
        ULONG unknown7;
        UNICODE_STRING path;
        UNICODE_STRING name;
        ULONG   Flags;
    } KLDR_DATA_TABLE_ENTRY, *PKLDR_DATA_TABLE_ENTRY;
#endif

//通杀x32和x64版
//这里字节对齐要采用默认，不要按1对齐，这样才符合32位和64位结构体
typedef struct _LDR_DATA_TABLE_ENTRY
{
	LIST_ENTRY InLoadOrderLinks;
	LIST_ENTRY InMemoryOrderLinks;
	LIST_ENTRY InInitializationOrderLinks;
	PVOID DllBase;
	PVOID EntryPoint;
	ULONG SizeOfImage;
	UNICODE_STRING FullDllName;
	UNICODE_STRING BaseDllName;
	ULONG Flags;
	USHORT LoadCount;
	USHORT TlsIndex;
	union
	{
		LIST_ENTRY HashLinks;
		struct
		{
			PVOID SectionPointer;
			ULONG CheckSum;
		};
	};
	union
	{
		struct
		{
			ULONG TimeDateStamp;
		};
		struct
		{
			PVOID LoadedImports;
		};
	};
	struct _ACTIVATION_CONTEXT * EntryPointActivationContext;
	PVOID PatchInformation;
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;
```

![image-20210828154334924](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210828154334924.png)

\_DRIVER_OBJECT结构可以通过DriverSection找到记录所有内核模块简单信息的双向链表，但双向链表没法找回\_DRIVER_OBJECT结构。因此即使是在双向链表中将目标驱动断链了，对于pchunter也依然能找到内核对象，原因是因为pchunter是通过特征码直接索引到\_DRIVER_OBJECT结构来遍历所有内核模块，而非通过该双向链表

### 遍历内核模块作业

**驱动对象遍历，模块隐藏（断链）**

```c
#include <ntddk.h>

unsigned int OldDriverSection= 0;//保存原DriverSection

//卸载函数
VOID DriverUnload(PDRIVER_OBJECT driver)
{
	//恢复原链和原DriverSection
	if (OldDriverSection != 0)
	{
		//恢复原DriverSection
		unsigned int DriverSectionAddr = (unsigned int)driver + 0x014;
		*(unsigned int*)DriverSectionAddr = OldDriverSection;
		//恢复原链
		unsigned int currentIndex = *(unsigned int*)DriverSectionAddr;
		unsigned int lastIndex = *(unsigned int*)(currentIndex + 0x4);
		*(unsigned int*)lastIndex = currentIndex;
		*(unsigned int*)(*(unsigned int*)(currentIndex)+0x4) = currentIndex;

	}
	DbgPrint("停止运行了\n");
}

//内核对象链表遍历
VOID forEachDriverChain(PDRIVER_OBJECT pdriver)
{
	unsigned int DriverSection = (unsigned int)pdriver + 0x014;
	//DbgPrint("DriverSection:%X\n", DriverSection);
	unsigned int beginIndex = *(unsigned int*)DriverSection;
	unsigned int currentIndex = beginIndex;
	DbgPrint("----------------------------------------\r\n");
	do
	{
		PUNICODE_STRING BaseDllName = (PUNICODE_STRING)(currentIndex + 0x02c);
		DbgPrint("%wZ\r\n", BaseDllName);
		currentIndex=*(unsigned int*)currentIndex;

	} while (currentIndex != beginIndex);
	DbgPrint("----------------------------------------\r\n");
}
//内核对象链表断链
VOID BreakDriverChain(PDRIVER_OBJECT pdriver)
{
	unsigned int DriverSectionAddr = (unsigned int)pdriver + 0x014;
	//DbgPrint("DriverSection:%X\n", DriverSection);
	unsigned int currentIndex = *(unsigned int*)DriverSectionAddr;
	unsigned int lastIndex = *(unsigned int*)(currentIndex +0x4);
	*(unsigned int*)lastIndex = *(unsigned int*)(currentIndex);
	*(unsigned int*)(*(unsigned int*)(currentIndex)+0x4) = lastIndex;
	//修正原PDRIVER_OBJECT中的DriverSection指向前一个链表
	OldDriverSection = *(unsigned int*)DriverSectionAddr;
	*(unsigned int*)DriverSectionAddr = lastIndex;
}

//入口函数，相当于main函数
NTSTATUS DriverEntry(PDRIVER_OBJECT pdriver, PUNICODE_STRING pReg)
{
	//驱动程序的入口
	DbgPrint("hello world!\n");
	DbgPrint("pdriver:%wZ\r\n",pReg);
	DbgPrint("pReg:%p\r\n",pdriver);
	DbgPrint("hello world!\n");
	DbgPrint("===============断链前==============\n");
	forEachDriverChain(pdriver);
	BreakDriverChain(pdriver);
	DbgPrint("===============断链后==============\n");
	forEachDriverChain(pdriver);

	//设置一个卸载函数，用于退出
	pdriver->DriverUnload = DriverUnload;
	return STATUS_SUCCESS;
}
```

打印如下：

```c
hello world!
pdriver:\REGISTRY\MACHINE\SYSTEM\ControlSet002\Services\HelloWorld
pReg:81DDCD18
hello world!
===============断链前==============
----------------------------------------
HelloWorld.sys
(null)
ntoskrnl.exe
hal.dll
kdcom.dll
BOOTVID.dll
ACPI.sys
WMILIB.SYS
pci.sys
isapnp.sys
compbatt.sys
BATTC.SYS
intelide.sys
PCIIDEX.SYS
MountMgr.sys
ftdisk.sys
dmload.sys
dmio.sys
PartMgr.sys
vmci.sys
VolSnap.sys
vsock.sys
atapi.sys
disk.sys
CLASSPNP.SYS
fltMgr.sys
sr.sys
KSecDD.sys
Ntfs.sys
NDIS.sys
Mup.sys
agp440.sys
i8042prt.sys
kbdclass.sys
vmmouse.sys
mouclass.sys
serial.sys
serenum.sys
imapi.sys
cdrom.sys
redbook.sys
ks.sys
vmx_svga.sys
VIDEOPRT.SYS
usbuhci.sys
USBPORT.SYS
vmxnet.sys
es1371mp.sys
portcls.sys
drmk.sys
usbehci.sys
CmBatt.sys
intelppm.sys
fsvga.sys
audstub.sys
rasl2tp.sys
ndistapi.sys
ndiswan.sys
raspppoe.sys
raspptp.sys
TDI.SYS
psched.sys
msgpc.sys
ptilink.sys
raspti.sys
rdpdr.sys
termdd.sys
swenum.sys
update.sys
mssmbios.sys
NDProxy.SYS
usbhub.sys
USBD.SYS
gameenum.sys
Fs_Rec.SYS
Null.SYS
Beep.SYS
vga.sys
mnmdd.SYS
RDPCDD.sys
Msfs.SYS
Npfs.SYS
rasacd.sys
ipsec.sys
tcpip.sys
netbt.sys
ws2ifsl.sys
afd.sys
netbios.sys
vmhgfs.sys
rdbss.sys
mrxsmb.sys
Fips.SYS
ipnat.sys
Cdfs.SYS
wanarp.sys
usbccgp.sys
hidusb.sys
HIDCLASS.SYS
HIDPARSE.SYS
BTHUSB.sys
bthport.sys
mouhid.sys
vmusbmouse.sys
dump_atapi.sys
dump_WMILIB.SYS
win32k.sys
Dxapi.sys
watchdog.sys
dxg.sys
dxgthk.sys
vmx_fb.dll
rfcomm.sys
BthEnum.sys
bthpan.sys
ndisuio.sys
wdmaud.sys
sysaudio.sys
mrxdav.sys
vmmemctl.sys
srv.sys
HTTP.sys
Dbgv.sys
----------------------------------------
===============断链后==============
----------------------------------------
Dbgv.sys
(null)
ntoskrnl.exe
hal.dll
kdcom.dll
BOOTVID.dll
ACPI.sys
WMILIB.SYS
pci.sys
isapnp.sys
compbatt.sys
BATTC.SYS
intelide.sys
PCIIDEX.SYS
MountMgr.sys
ftdisk.sys
dmload.sys
dmio.sys
PartMgr.sys
vmci.sys
VolSnap.sys
vsock.sys
atapi.sys
disk.sys
CLASSPNP.SYS
fltMgr.sys
sr.sys
KSecDD.sys
Ntfs.sys
NDIS.sys
Mup.sys
agp440.sys
i8042prt.sys
kbdclass.sys
vmmouse.sys
mouclass.sys
serial.sys
serenum.sys
imapi.sys
cdrom.sys
redbook.sys
ks.sys
vmx_svga.sys
VIDEOPRT.SYS
usbuhci.sys
USBPORT.SYS
vmxnet.sys
es1371mp.sys
portcls.sys
drmk.sys
usbehci.sys
CmBatt.sys
intelppm.sys
fsvga.sys
audstub.sys
rasl2tp.sys
ndistapi.sys
ndiswan.sys
raspppoe.sys
raspptp.sys
TDI.SYS
psched.sys
msgpc.sys
ptilink.sys
raspti.sys
rdpdr.sys
termdd.sys
swenum.sys
update.sys
mssmbios.sys
NDProxy.SYS
usbhub.sys
USBD.SYS
gameenum.sys
Fs_Rec.SYS
Null.SYS
Beep.SYS
vga.sys
mnmdd.SYS
RDPCDD.sys
Msfs.SYS
Npfs.SYS
rasacd.sys
ipsec.sys
tcpip.sys
netbt.sys
ws2ifsl.sys
afd.sys
netbios.sys
vmhgfs.sys
rdbss.sys
mrxsmb.sys
Fips.SYS
ipnat.sys
Cdfs.SYS
wanarp.sys
usbccgp.sys
hidusb.sys
HIDCLASS.SYS
HIDPARSE.SYS
BTHUSB.sys
bthport.sys
mouhid.sys
vmusbmouse.sys
dump_atapi.sys
dump_WMILIB.SYS
win32k.sys
Dxapi.sys
watchdog.sys
dxg.sys
dxgthk.sys
vmx_fb.dll
rfcomm.sys
BthEnum.sys
bthpan.sys
ndisuio.sys
wdmaud.sys
sysaudio.sys
mrxdav.sys
vmmemctl.sys
srv.sys
HTTP.sys
----------------------------------------
停止运行了
```

由上面打印可知HelloWorld.sys成功被隐藏，但pchunter依然可以查找到我们的驱动

**真隐藏（pchunter无法找到）**

```c
#include <ntddk.h>
typedef struct _LDR_DATA_TABLE_ENTRY {
	LIST_ENTRY InLoadOrderLinks;
	LIST_ENTRY InMemoryOrderLinks;
	LIST_ENTRY InInitializationOrderLinks;
	PVOID DllBase;
	PVOID EntryPoint;
	ULONG SizeOfImage;
	UNICODE_STRING FullDllName;
	UNICODE_STRING BaseDllName;
	ULONG Flags;
	USHORT LoadCount;
	USHORT TlsIndex;
	union {
		LIST_ENTRY HashLinks;
		struct {
			PVOID SectionPointer;
			ULONG CheckSum;
		};
	};
	union {
		struct {
			ULONG TimeDateStamp;
		};
		struct {
			PVOID LoadedImports;
		};
	};
	struct _ACTIVATION_CONTEXT * EntryPointActivationContext;

	PVOID PatchInformation;

} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;

HANDLE hThread;

VOID DriverUnload(PDRIVER_OBJECT pDriver)
{
	KdPrint(("卸载的了"));
}

VOID threadRun(_In_ PVOID StartContext)
{
	KdPrint(("开始执行1\n"));
	LARGE_INTEGER times;
	times.QuadPart = -30 * 1000 * 1000;
	KeDelayExecutionThread(KernelMode, FALSE, &times);
	PDRIVER_OBJECT pDriver = (PDRIVER_OBJECT)StartContext;
	//抹除特征
    pDriver->DriverSize = 0;
	pDriver->DriverSection = NULL;
	pDriver->DriverExtension = NULL;
	pDriver->DriverStart = NULL;
	pDriver->DriverInit = NULL;
	pDriver->FastIoDispatch = NULL;
	pDriver->DriverStartIo = NULL;
	ZwClose(hThread);
	KdPrint(("执行结束1\n"));
}


NTSTATUS DriverEntry(PDRIVER_OBJECT pDriver, PUNICODE_STRING pReg)
{
	KdPrint(("驱动被加载\n"));
	PLDR_DATA_TABLE_ENTRY pList = (PLDR_DATA_TABLE_ENTRY)pDriver->DriverSection;
	PLDR_DATA_TABLE_ENTRY pCur = pList;
	pList = pList->InLoadOrderLinks.Flink;

	pList->InLoadOrderLinks.Blink = pCur->InLoadOrderLinks.Blink;
	pCur->InLoadOrderLinks.Flink = pList;

	pDriver->DriverUnload = DriverUnload;

	PsCreateSystemThread(&hThread, GENERIC_ALL, NULL, NULL, NULL, threadRun, pDriver);

	return STATUS_SUCCESS;
}
```

上面代码可让pchunter也找不到驱动，但此代码只做了抹特征隐藏，却并未恢复特征或手动调用函数卸载驱动。停止驱动的时候会因为信息缺失直接蓝屏。需要一个时间点做恢复特征（不可以在DriverUnload中，因为是还没到该函数就蓝屏了）。

64位下不能直接断链(PG的原因)

MiProcessLoaderEntry，第一个参数是当前链表，第二个参数false表示卸载，true表示插入。该函数模块从链表上移除了，但没有释放内存。

64位用这个函数不会触发PG，不会蓝屏。PG可以理解成就是保护全局变量bu不被直接修改。

**KdPrint和DbgPrint的区别：**

```c
#if DBG
	#define KdPrint(_x_) DbgPrint _x_
#else
	#define KdPrint(_x_)//把KdPrint(_x_)宏替换成什么也没有
//即如下两句在debug模式下含义相同:
KdPrint(("hello World!\n"));
DbgPrint("hello World!\n");
//但在release模式下，KdPrint不会打印。
```

### 驱动键鼠过滤

IoAttachDevice绑定设备

```c
NTSTATUS
IoAttachDevice(
IN PDEVICE_OBJECT SourceDevice,//生成的设备对象
IN PUNICODE_STRING TargetDevice,//目标串口设备名称
OUT PDEVICE_OBJECT *AttachedDevice//【返回被绑定设备指针】的指针
);
```

使用：

```c
UNICODE_STRING com_name = RLT_CONSTANT_STRING(L"\\Device\\Serial0");
NTSTATUS status = IoAttachDevice(com_filter_device,&com_device_name,&attached_device);
```

## 驱动开发中的链表

**常用函数**

- IsListEmpty          判断链表是否为空  
- InitializeListHead  初始化双向链表头  
- InsertHeadList      插入链表头部   
- InsertTailList         插入链表尾部   
- RemoveHeadList  移除头部节点   
- RemoveTailList     移除尾部节点  
- RemoveEntryList  移除当前节点   

[详细说法]: https://blog.csdn.net/m0_46125480/article/details/120587783

链表在驱动中需要处理同步,因为链表涉及到指针操作,一不小心就可能导致蓝屏.

因此驱动开发中数组可以不需要同步处理(多线程写入同一个位置一样可能有问题,但概率没那么大),但链表必须做[同步处理](#完美过掉对象保护钩子)

## 零环与三环通信(常规方式)

常规方式表示微软提供的正常通信方式，还有非常规通信。正常通信方式受到一定限制。

**设备对象**

我们在开发窗口程序的时候，消息被封装成一个结构体：MSG，**在内核开发时，消息被封装成另外一个结构体：IRP**（I/O Request Package输入输出请求包）

在窗口程序中，能够接受消息的只能是窗口对象。在内核中，能够接收IRP消息的只能是设备对象

![image-20210827111116147](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210827111116147.png)

- **驱动对象**（DRIVER_OBJECT）生成多个设备对象，
- **设备对象**（DEVICE_OBJECT）可以是硬件（硬盘等），也可以是软件，比如NTFS文件系统。它们都属于设备对象。

![image-20210829163134914](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210829163134914.png)

![sdsad](https://raw.githubusercontent.com/che77a38/blogImage/main/sdsad.jpeg)

### [创建设备对象](https://docs.microsoft.com/zh-cn/windows-hardware/drivers/ddi/wdm/nf-wdm-iocreatedevice)

#### 设备对象结构

```c
typedef struct DECLSPEC_ALIGN(MEMORY_ALLOCATION_ALIGNMENT) _DEVICE_OBJECT
{
    CSHORT Type;//类型
    USHORT Size;//大小
    LONG ReferenceCount;//引用计数
    /*指向驱动程序中驱动对象的指针*/
    struct _DRIVER_OBJECT *DriverObject;//设备所属的驱动对象
    /*指向下一个设备对象的指针*/
    struct _DEVICE_OBJECT *NextDevice;//下一个设备对象，在一个驱动对象中有N个设备，这些设备用这个指针连接起来作为一个单向的链表
    struct _DEVICE_OBJECT *AttachedDevice;
    /*当前IRP结构*/
    struct _IRP *CurrentIrp;
    PIO_TIMER Timer;
    /*设备对象的特性标志*/
    ULONG Flags;
    ULONG Characteristics;
    _volatile PVPB Vpb;
    /*指向设备扩展对象的指针*/
    PVOID DeviceExtension;
    /*指明设备类型*/
    DEVICE_TYPE DeviceType;
    /*堆栈的最小层数*/
    CCHAR StackSize;//IRP栈的大小,用于存放参数的
    union {
        LIST_ENTRY ListEntry;
        WAIT_CONTEXT_BLOCK Wcb;
    } Queue;
    /*内存对齐*/
    ULONG AlignmentRequirement;
    KDEVICE_QUEUE DeviceQueue;
    KDPC Dpc;
    /*
    *下列成员用于支持文件系统的互斥操作
    *以便对文件系统处理线程使用设备的计数保持跟踪
    */
    ULONG ActiveThreadCount;
    PSECURITY_DESCRIPTOR SecurityDescriptor;
    KEVENT DeviceLock;
 
    USHORT SectorSize;
    USHORT Spare1;
 
    struct _DEVOBJ_EXTENSION  *DeviceObjectExtension;
    PVOID  Reserved;
 
} DEVICE_OBJECT;
typedef struct _DEVICE_OBJECT *PDEVICE_OBJECT;
```

#### IoCreateDevice

```c
NTSTATUS IoCreateDevice(
  PDRIVER_OBJECT  DriverObject,//驱动对象指针
  ULONG           DeviceExtensionSize,//指定要为设备对象的设备扩展分配的驱动程序确定的字节数；设备扩展内存的大小，你可以在这申请一块非分页内存，只要设备还在，就都可以用，可以用它代替全局变量。
  PUNICODE_STRING DeviceName,//可选地指向一个缓冲区，该缓冲区包含一个以空字符结尾的 Unicode 字符串，用于命名设备对象。该字符串必须是完整路径名。
  DEVICE_TYPE     DeviceType,//一般用FILE_DEVICE_UNKNOWN，#define FILE_DEVICE_UNKNOWN             0x00000022
  ULONG           DeviceCharacteristics,//基本就是填FILE_DEVICE_SECURE_OPEN
  BOOLEAN         Exclusive,//TRUE代表设备是独占的，FALSE代表该设备是共享的；独享可以防止前面的驱动拦截后面的驱动的派遣函数处理
  PDEVICE_OBJECT  *DeviceObject//【out】二级指针，目的是返回设备对象指针
);

//给某个设备发送IRP请求
NTSTATUS MyDispath(PDEVICE_OBJECT device,PIRP irp);
```

实例：

```c
//创建设备名称
UNICODE_STRING Devicename;
RtlInitUnicodeString(&Devicename,L"\\Device\\MyDevice");//\\Device尽量不要改，为了让驱动文件同一个树结构下，方便统一。该名字是给零环用的，三环通过这个名字是找不到该设备对象的。

//设备对象指针，用于接受
PDEVICE_OBJECT pDeviceObj = NULL;
//创建设备
status = IoCreateDevice(
pDriver,				//当前设备所属的驱动对象
0,
&Devicename,			//设备对象的名称
FILE_DEVICE_UNKNOWN,//不知道什么类型
FILE_DEVICE_SECURE_OPEN,
TRUE,
&pDeviceObj			//【out】设备对象指针
);
if(!NT_SUCCESS(status))//NT_SUCCESS,微软提供的，实际上就是判断status是否大于等于0
{
    DbgPrint("创建设备失败!\n");
    return status;
}
```

### 删除设备对象

```c
IoDeleteDevice(pDeviceObj);//删除设备
```

### 设置交互数据的方式

```c
//如果前面创建设备对象成功，就设置交互数据的方式
pDeviceObj->Flags |= DO_BUFFERED_IO;
```

- **缓冲区方式读写(DO_BUFFERED_IO)**：操作系统将应用程序提供缓冲区的数据复制到内核模式下的地址中。(效率不高，适合小规模数据)
- **直接方式读写(DO_DIRECT_IO)**：操作系统会将用户模式下的缓冲区锁住。然后操作系统将这段缓冲区在内核模式地址再次映射一遍。这样，用户模式的缓冲区和内核模式的缓冲区指向的是同一区域的物理内存。缺点就是要单独占用物理页面。(适合大规模数据，比较浪费物理页)
- **其他方式读写**(在调用IoCreateDevice创建设备后对pDevObj->Flags即不设置DO_BUFFERED_IO，也不设置DO_DIRECT_IO，此时就是其他方式)：在使用其他方式读写设备时，派遣函数直接读写应用程序提供的缓冲区地址。在驱动程序中，直接操作应用程序的缓冲区地址是很危险的**(这种方法须要注意的是ReadFile可能把空指针地址或者非法地址传递给驱动程序，因此驱动程序使用用户模式地址前须要检查是否可读或者可写)**。**只有驱动程序与应用程序运行在相同线程上下文的情况下，才能使用这种方式**。

```c
//读写方式不一样,则读写的位置不一样
if(DeviceObject->Flags&DO_BUFFERED_IO)//缓冲区方式读写
	{
		KdPrint(("Flags:DO_BUFFER_IO\n"));
		pBuffer=Irp->AssociatedIrp.SystemBuffer;
	}
	else if(DeviceObject->Flags&DO_DIRECT_IO)//直接方式读写
	{
		KdPrint(("Flags:DO_DIRECT_IO\n"));
		pBuffer=MmGetSystemAddressForMdl(Irp->MdlAddress);
	}
	else//其他方式读写
	{
		KdPrint(("Flags:Neither\n"));
		pBuffer=Irp->UserBuffer;
	}
//ReadFile和WriteFile方式通信的内核缓冲区长度在IrpStack->Parameters.Read.Length和IrpStack->Parameters.Write.Length中
```

### 创建与卸载符号链接

就是设置一个名字，让三环可以通过这个名字找到设备对象来操作他。

```c
//创建符号链接名称
UNICODE_STRING SymbolicLinkName;
RtlInitUnicodeString(&SymbolicLinkName,L"\\??\\MyTestDriver");
//两个问号代表根目录
//Ring3用CreateFile打开设备时，用"\\\\.\\MyTestDriver"(实际上就是地址要\\.\开始，但是要转义，所以为\\\\.\\)

//创建符号链接
status = IoCreateSymbolicLink(&SymbolicLinkName,&Devicename);
if(status!=STATUS_SUCCESS)
{
    DbgPrint("创建符号链接失败!\n");
    IoDeleteDevice(pDeviceObj);//删除设备
    return status;
}

//卸载符号链接
IoDeleteSymbolicLink(&SymbolicLinkName);
```

特别说明：

1. 设备名称的作用是给内核对象用的，如果要在Ring3访问，必须要有符号链接，其实就是一个别名，没有这个别名，在Ring3不可见
2. **内核模式下，符号链接是以"\??\"开头的，如C盘就是"\??\C:"**
3. **用户模式下，则是以"\\\\.\\\"开头的，如C盘就是"\\\\.\\C:"**

创建设备对象并设置符号链接

```c
#define _LINK_NAME L"\\??\\MyDriver"
NTSTATUS CreateDevice(PDRIVER_OBJECT driver)
{
    NTSTATUS status;
    UNICODE_STRING MyDriver;//驱动字符串
    PDEVICE_OBJECT device = NULL;//用于存放设备对象
    RtlInitUnicodeString(&MyDriver, L"\\DEVICE\\MyDriver");
    status = IoCreateDevice(driver,
        sizeof(driver->DriverExtension),
        &MyDriver,
        FILE_DEVICE_UNKNOWN,
        FILE_DEVICE_SECURE_OPEN,
        FALSE,
        &device
    );
    if (status==STATUS_SUCCESS)
    {
        KdPrint(("zeroko14:kernel:驱动设备对象创建成功\n"));
        UNICODE_STRING uzSymbolName;
        RtlInitUnicodeString(&uzSymbolName, _LINK_NAME);
        status = IoCreateSymbolicLink(&uzSymbolName, &MyDriver);
        if (status == STATUS_SUCCESS)
        {
            KdPrint(("zeroko14:kernel:创建符号链接%wZ成功\n", &uzSymbolName));
        }
        else
        {
            KdPrint(("zeroko14:kernel:创建符号链接%wZ失败  status:%X\n", &uzSymbolName,status));
        }
    }
    else
    {
        KdPrint(("zeroko14:kernel:驱动对象创建失败,删除设备\n"));
        IoDeleteDevice(device);
    }
}
```

### IRP与派遣函数

![image-20210827114410752](https://raw.githubusercontent.com/che77a38/blogImage/main/image-20210827114410752.png)

驱动程序与I/O管理器通信，使用的是IRP，即**I/O请求包**。

#### IRP类型

1. 当应用层通过CreateFile，ReadFile，WriteFile，CloseHandle等函数打开，从设备读取数据，向设备写入数据，关闭设备的时候，会使操作系统分别产生出IRP_MJ_CREATE,IRP_MJ_READ,IRP_MJ_WRITE,IRP_MJ_CLOSE等不同的IRP。

2. 其他类型的IRP

   | IRP类型                                                      | 来源                                |
   | ------------------------------------------------------------ | ----------------------------------- |
   | **IRP_MJ_DEVICE_CONTROL**                                    | DeviceIoControl函数会产生此IRP      |
   | IRP_MJ_POWER                                                 | 在操作系统处理电源信息时，产生此IRP |
   | IRP_MJ_SHUTDOWN                                              | 关闭系统前会产生此IRP               |
   | IRP_MJ_CREATE                                                | 生成请求 CreateFile                 |
   | IRP_MJ_QUERY_INFORMATION                                     | 查询请求                            |
   | IRP_MJ_CLOSE                                                 | 关闭请求 CloseHandle                |
   | IRP_MJ_SET_INFORMATION                                       | 设置请求                            |
   | IRP_MJ_READ                                                  | 从设备得到数据 ReadFile             |
   | IRP_MJ_WRITE                                                 | 传送数据到设备 WriteFile            |
   | [还有很多。。。](https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/irp-major-function-codes) | 。。。                              |

   IRP_MJ_DEVICE_CONTROL是我们用的最多的一种方式，比较灵活。可以拿到三环传过来的消息码，自己设定怎么处理(通过消息码确定)。

3. 每个IRP都对应一个输入输出

##### IRP结构

```c
typedef struct _IRP {
	PMDL              MdlAddress;//是一个MDL的指针，当内核层和用户层采用共享内存的结构传递数据的时候，这个MDL就代表共享的内存信息（共享物理内存，通过MDL映射）。这个成员生效的标记为：DO_DIRECT_IO, METHOD_IN_DIRECT 或者METHOD_OUT_DIRECT.
	ULONG             Flags;
	union {
		struct _IRP*   MasterIrp;
		PVOID          SystemBuffer;
	} AssociatedIrp;
	IO_STATUS_BLOCK   IoStatus;
	KPROCESSOR_MODE   RequestorMode;
	BOOLEAN           PendingReturned;
	BOOLEAN           Cancel;
	KIRQL             CancelIrql;
	PDRIVER_CANCEL    CancelRoutine;
	PVOID             UserBuffer;
	union {
		struct {
			union {
				KDEVICE_QUEUE_ENTRY DeviceQueueEntry;
				struct {
					PVOID    DriverContext[4];
				};
			};
			PETHREAD     Thread;
			LIST_ENTRY   ListEntry;
		} Overlay;
	} Tail;
} IRP, *PIRP;

kd> dt nt!_IRP
   +0x000 Type             : Int2B
   +0x002 Size             : Uint2B
   +0x004 MdlAddress       : Ptr32 _MDL
   +0x008 Flags            : Uint4B
   +0x00c AssociatedIrp    : <unnamed-tag>
   +0x010 ThreadListEntry  : _LIST_ENTRY
   +0x018 IoStatus         : _IO_STATUS_BLOCK
   +0x020 RequestorMode    : Char
   +0x021 PendingReturned  : UChar
   +0x022 StackCount       : Char
   +0x023 CurrentLocation  : Char
   +0x024 Cancel           : UChar
   +0x025 CancelIrql       : UChar
   +0x026 ApcEnvironment   : Char
   +0x027 AllocationFlags  : UChar
   +0x028 UserIosb         : Ptr32 _IO_STATUS_BLOCK
   +0x02c UserEvent        : Ptr32 _KEVENT
   +0x030 Overlay          : <unnamed-tag>
   +0x038 CancelRoutine    : Ptr32     void 
   +0x03c UserBuffer       : Ptr32 Void
   +0x040 Tail             : <unnamed-tag>
```

每个IRP对应一个`IO_STACK_LOCATION结构`,通过下面的函数可以获取到此IRP对应的`IO_STACK_LOCATION结构`

`IoGetCurrentIrpStackLocation`返回一个指向IO_STACK_LOCATION结构的指针，该结构包含驱动程序的 I/O 堆栈位置

![IRP](https://raw.githubusercontent.com/che77a38/blogImage2/main/202204241910209.jpeg)

**上图为DeviceIoControl方式读写**,如果是用ReadFile/WriteFile方式读写,应参考[设置交互数据的方式](#设置交互数据的方式)

注意information设置不正确.案例中,仅传一个整形数据时候,设置到99,导致蓝屏(吃了大亏)

##### IO_STACK_LOCATION结构

[IO_STACK_LOCATION结构详解]: https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/wdm/ns-wdm-_io_stack_location?redirectedfrom=MSDN

#### 派遣函数

##### 派遣函数在哪里注册呢？

```c
kd> dt _DRIVER_OBJECT
nt!_DRIVER_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT
   +0x008 Flags            : Uint4B
   +0x00c DriverStart      : Ptr32 Void
   +0x010 DriverSize       : Uint4B
....
   +0x030 DriverStartIo    : Ptr32     void 
   +0x034 DriverUnload     : Ptr32     void 		//卸载函数
   +0x038 MajorFunction    : [28] Ptr32     long 	//派遣函数
   //0编号的IRP对应的派遣函数的地址就存在MajorFunction[0]的位置。
```

0编号的IRP对应的派遣函数的地址就存在MajorFunction[0]的位置。

##### 注册派遣函数

```c
NTSTATUS DriverEntry(PDRIVER_OBJECT pDriverObject, PUNICODE_STRING pReg)  
{  
    //设置卸载函数   
    pDriverObject->DriverUnload = 卸载函数;  
  
    //设置派遣函数   
    pDriverObject->MajorFunction[IRP_MJ_CREATE] 	= 派遣函数1; //一般都处理 对应用户层CreateFile
    pDriverObject->MajorFunction[IRP_MJ_CLOSE] 	= 派遣函数2;  //一般都处理  对应用户层CloseHandle
    pDriverObject->MajorFunction[IRP_MJ_WRITE] 	= 派遣函数3;  
    pDriverObject->MajorFunction[IRP_MJ_READ] 	= 派遣函数4;  
    pDriverObject->MajorFunction[IRP_MJ_CLEANUP] 	= 派遣函数5;  
    pDriverObject->MajorFunction[IRP_MJ_SET_INFORMATION] 	= 派遣函数6;  
    pDriverObject->MajorFunction[IRP_MJ_DEVICE_CONTROL] 	= 派遣函数7;  //一般都处理   对应用户层DeviceIoControl
    pDriverObject->MajorFunction[IRP_MJ_SHUTDOWN] 		= 派遣函数8;  
    pDriverObject->MajorFunction[IRP_MJ_SYSTEM_CONTROL] 	= 派遣函数9;
} 
