[
  "obsidian-enhancing-export",
  "link-info-server",
  "remotely-save",
  "global-search-and-replace",
  "obsidian-image-auto-upload-plugin",
  "easy-typing-obsidian",
  "cm-typewriter-scroll-obsidian",
  "obsidian-table-generator",
  "obsidian-minimal-settings",
  "table-editor-obsidian",
  "editing-toolbar",
  "obsidian-quiet-outline",
  "obsidian-hider"
]